CREATE DATABASE  IF NOT EXISTS `travel_db` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `travel_db`;
-- MySQL dump 10.13  Distrib 8.0.46, for Win64 (x86_64)
--
-- Host: localhost    Database: travel_db
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin_location`
--

DROP TABLE IF EXISTS `admin_location`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_location` (
  `Admin_Location_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Parent_ID` int DEFAULT NULL,
  `Level` int DEFAULT '1',
  PRIMARY KEY (`Admin_Location_ID`),
  KEY `Parent_ID` (`Parent_ID`),
  CONSTRAINT `admin_location_ibfk_1` FOREIGN KEY (`Parent_ID`) REFERENCES `admin_location` (`Admin_Location_ID`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=1658 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_location`
--

LOCK TABLES `admin_location` WRITE;
/*!40000 ALTER TABLE `admin_location` DISABLE KEYS */;
INSERT INTO `admin_location` VALUES (1,'Россия',NULL,1),(2,'Иркутская область',1,2),(3,'Аларский район',2,3),(4,'село Аларь',3,4),(5,'село Александровск',3,4),(6,'деревня Алзобей',3,4),(7,'село Аляты',3,4),(8,'поселок Ангарский',3,4),(9,'деревня Апхайта',3,4),(10,'село Апхульта',3,4),(11,'деревня Аргалей',3,4),(12,'деревня Аршан',3,4),(13,'деревня Балтуй',3,4),(14,'село Бахтай',3,4),(15,'деревня Берестенникова',3,4),(16,'деревня Большая Ерма',3,4),(17,'деревня Буркова',3,4),(18,'деревня Бурятская',3,4),(19,'поселок Быково',3,4),(20,'деревня Вершина',3,4),(21,'деревня Высотская',3,4),(22,'село Головинское',3,4),(23,'деревня Готол',3,4),(24,'деревня Дута',3,4),(25,'деревня Егоровская',3,4),(26,'деревня Жлобина',3,4),(27,'посёлок Забитуй',3,4),(28,'деревня Зангей',3,4),(29,'деревня Занина',3,4),(30,'деревня Заречное',3,4),(31,'село Зоны',3,4),(32,'село Иваническое',3,4),(33,'деревня Иванова',3,4),(34,'село Идеал',3,4),(35,'деревня Кербулак',3,4),(36,'деревня Киркей',3,4),(37,'деревня Кирюшина',3,4),(38,'деревня Ключи',3,4),(39,'деревня Корховская',3,4),(40,'село Куйта',3,4),(41,'деревня Кукунур',3,4),(42,'деревня Кундулун',3,4),(43,'деревня Куркат',3,4),(44,'посёлок Кутулик',3,4),(45,'деревня Малолучинск',3,4),(46,'деревня Маломолева',3,4),(47,'деревня Малый Кутулик',3,4),(48,'деревня Маниловская',3,4),(49,'деревня Мардай',3,4),(50,'село Могоенок',3,4),(51,'деревня Могой',3,4),(52,'деревня Мольта',3,4),(53,'деревня Нарены',3,4),(54,'деревня Нельхай',3,4),(55,'деревня Ныгда',3,4),(56,'деревня Омулевка',3,4),(57,'деревня Отрадная',3,4),(58,'деревня Саган-Жалгай',3,4),(59,'село Табарсук',3,4),(60,'село Тыргетуй',3,4),(61,'деревня Тютрина',3,4),(62,'деревня Угольная',3,4),(63,'деревня Улзет',3,4),(64,'деревня Ундэр-Хуан',3,4),(65,'деревня Халта',3,4),(66,'деревня Халты',3,4),(67,'деревня Хигинская',3,4),(68,'деревня Хуруй',3,4),(69,'деревня Чухлинская',3,4),(70,'деревня Шалоты',3,4),(71,'деревня Шапшалтуй',3,4),(72,'деревня Шастина',3,4),(73,'деревня Шаховская',3,4),(74,'деревня Шелемина',3,4),(75,'деревня Шульгина',3,4),(76,'Ангарск',2,3),(77,'Ангарский городской округ',2,3),(78,'посёлок Звездочка',77,4),(79,'посёлок Зверево',77,4),(80,'деревня Зуй',77,4),(81,'заимка Ивановка',77,4),(82,'посёлок Ключевая',77,4),(83,'посёлок Мегет',77,4),(84,'посёлок Новоодинск',77,4),(85,'село Одинск',77,4),(86,'село Савватеевка',77,4),(87,'посёлок Стеклянка',77,4),(88,'посёлок Ударник',77,4),(89,'деревня Чебогоры',77,4),(90,'заимка Якимовка',77,4),(91,'Балаганский район',2,3),(92,'деревня Анучинск',91,4),(93,'село Бирит',91,4),(94,'деревня Заславская',91,4),(95,'село Коновалово',91,4),(96,'село Кумарейка',91,4),(97,'деревня Метляева',91,4),(98,'деревня Одиса',91,4),(99,'поселок Приморский',91,4),(100,'деревня Тарасовск',91,4),(101,'село Тарнополь',91,4),(102,'деревня Ташлыкова',91,4),(103,'село Шарагай',91,4),(104,'поселок Балаганск',2,3),(105,'Баяндаевский район',2,3),(106,'деревня Бадагуй',105,4),(107,'село Байша',105,4),(108,'деревня Бахай 1-й',105,4),(109,'деревня Бахай 2-й',105,4),(110,'деревня Бохолдой',105,4),(111,'село Васильевка',105,4),(112,'деревня Вершининск',105,4),(113,'деревня Духовщина',105,4),(114,'деревня Еленинск',105,4),(115,'деревня Загатуй',105,4),(116,'деревня Идыгей',105,4),(117,'деревня Кайзаран',105,4),(118,'поселок Каменка',105,4),(119,'деревня Кокорина',105,4),(120,'деревня Лидинская',105,4),(121,'деревня Люры',105,4),(122,'деревня Малан',105,4),(123,'деревня Маралтуй',105,4),(124,'поселок Маяк',105,4),(125,'деревня Мильзан',105,4),(126,'деревня Молой',105,4),(127,'село Нагалык',105,4),(128,'деревня Нагатай',105,4),(129,'деревня Наумовка',105,4),(130,'деревня Нуху-Нур',105,4),(131,'деревня Ныгей',105,4),(132,'село Ользоны',105,4),(133,'деревня Онгой',105,4),(134,'деревня Покровка',105,4),(135,'село Половинка',105,4),(136,'деревня Сондой',105,4),(137,'деревня Старый Хогот',105,4),(138,'деревня Толстовка',105,4),(139,'село Тургеневка',105,4),(140,'деревня Тухум',105,4),(141,'деревня Тыпкысыр',105,4),(142,'деревня Улан',105,4),(143,'село Хандабай',105,4),(144,'деревня Хандагай',105,4),(145,'деревня Харагун',105,4),(146,'село Хатар-Хадай',105,4),(147,'деревня Хиней',105,4),(148,'село Хогот',105,4),(149,'деревня Хотогор',105,4),(150,'деревня Шаманка',105,4),(151,'деревня Шехаргун',105,4),(152,'деревня Шитхулун',105,4),(153,'село Баяндай',2,3),(154,'Бодайбинский район',2,3),(155,'поселок Апрельск',154,4),(156,'рабочий посёлок Артёмовский',154,4),(157,'рабочий посёлок Балахнинский',154,4),(158,'село Большой Патом',154,4),(159,'поселок Васильевский',154,4),(160,'рабочий посёлок Кропоткин',154,4),(161,'поселок Кяхтинский',154,4),(162,'рабочий посёлок Мамакан',154,4),(163,'поселок Маракан',154,4),(164,'село Нерпо',154,4),(165,'поселок Перевоз',154,4),(166,'поселок Светлый',154,4),(167,'Бодайбо',2,3),(168,'Боханский район',2,3),(169,'село Александровское',168,4),(170,'деревня Базой',168,4),(171,'деревня Байханова',168,4),(172,'деревня Булак',168,4),(173,'село Буреть',168,4),(174,'деревня Буреть',168,4),(175,'деревня Быргазова',168,4),(176,'заимка Вантеевская',168,4),(177,'деревня Вершина',168,4),(178,'посёлок Весёлая Поляна',168,4),(179,'деревня Воробьевка',168,4),(180,'деревня Граничная',168,4),(181,'заимка Грехневка',168,4),(182,'заимка Гречехан',168,4),(183,'деревня Гречехан',168,4),(184,'деревня Грязная',168,4),(185,'деревня Донская',168,4),(186,'село Дундай',168,4),(187,'деревня Ершова',168,4),(188,'поселок Заведение',168,4),(189,'деревня Заглик',168,4),(190,'заимка Захаровская',168,4),(191,'поселок Ида',168,4),(192,'деревня Ижилха',168,4),(193,'село Казачье',168,4),(194,'заимка Калашникова',168,4),(195,'село Каменка',168,4),(196,'деревня Картыгей',168,4),(197,'Александровское муниципальное образование',168,4),(198,'деревня Ключи',197,5),(199,'село Усолье-Жилкино',197,5),(200,'деревня Крюкова',168,4),(201,'деревня Кулакова',168,4),(202,'деревня Лаврентьевская',168,4),(203,'деревня Логанова',168,4),(204,'заимка Макаровская',168,4),(205,'деревня Манькова',168,4),(206,'заимка Махонькина',168,4),(207,'деревня Морозова',168,4),(208,'поселок Мутинова',168,4),(209,'деревня Нашата',168,4),(210,'село Новая Ида',168,4),(211,'деревня Нововоскресенка',168,4),(212,'деревня Новый Алендарь',168,4),(213,'село Олонки',168,4),(214,'деревня Парамоновка',168,4),(215,'заимка Пашкова',168,4),(216,'деревня Петрограновка',168,4),(217,'деревня Русиновка',168,4),(218,'деревня Середкина',168,4),(219,'заимка Склянка',168,4),(220,'село Тараса',168,4),(221,'деревня Тачигир',168,4),(222,'село Тихоновка',168,4),(223,'деревня Тымырей',168,4),(224,'заимка Тыргур',168,4),(225,'деревня Угольная',168,4),(226,'село Укыр',168,4),(227,'деревня Усть-Тараса',168,4),(228,'деревня Усть-Укыр',168,4),(229,'деревня Хандагай',168,4),(230,'деревня Харагун',168,4),(231,'деревня Харатирген',168,4),(232,'деревня Херетин',168,4),(233,'деревня Хонзой',168,4),(234,'деревня Хоргелок',168,4),(235,'село Хохорск',168,4),(236,'деревня Черниговская',168,4),(237,'деревня Чилим',168,4),(238,'деревня Шарагун',168,4),(239,'заимка Шипняговка',168,4),(240,'деревня Шунта',168,4),(241,'посёлок Бохан',2,3),(242,'Братский район',2,3),(243,'село Александровка',242,4),(244,'деревня Анчирикова',242,4),(245,'деревня Бада',242,4),(246,'поселок Бамбуй',242,4),(247,'деревня Барчим',242,4),(248,'село Большеокинское',242,4),(249,'поселок Боровской',242,4),(250,'деревня Булак',242,4),(251,'поселок Бурнинская Вихоря (Бурнинск)',242,4),(252,'деревня Воробьево',242,4),(253,'Вихоревка',242,4),(254,'поселок Добчур',242,4),(255,'село Дубынино',242,4),(256,'село Зарбь',242,4),(257,'поселок Зяба',242,4),(258,'село Илир',242,4),(259,'село Калтук',242,4),(260,'деревня Карай',242,4),(261,'поселок Карахун',242,4),(262,'деревня Кардой',242,4),(263,'поселок Кежемский',242,4),(264,'село Ключи-Булак',242,4),(265,'село Кобляково',242,4),(266,'село Кобь',242,4),(267,'деревня Куватка',242,4),(268,'село Кузнецовка',242,4),(269,'деревня Кумейка',242,4),(270,'деревня Леонова',242,4),(271,'поселок Луговой',242,4),(272,'поселок Мамырь',242,4),(273,'поселок Наратай',242,4),(274,'поселок Новодолоново',242,4),(275,'деревня Новое Приречье',242,4),(276,'посёлок Озёрный',242,4),(277,'поселок Октябрьск',242,4),(278,'поселок Пашенный',242,4),(279,'посёлок Первомайский',242,4),(280,'поселок Подвыездный',242,4),(281,'село Покосное',242,4),(282,'поселок Прибойный',242,4),(283,'посёлок Прибрежный',242,4),(284,'поселок Придорожный',242,4),(285,'посёлок Сахарово',242,4),(286,'посёлок Сосновый',242,4),(287,'село Тангуй',242,4),(288,'поселок Тарма',242,4),(289,'поселок Туковский',242,4),(290,'посёлок Турма',242,4),(291,'поселок Тынкобь',242,4),(292,'село Тэмь',242,4),(293,'поселок Харанжино',242,4),(294,'деревня Хахарей',242,4),(295,'поселок Хвойный',242,4),(296,'деревня Худобок',242,4),(297,'поселок Черемшанка',242,4),(298,'поселок Чистый',242,4),(299,'поселок Чистяково',242,4),(300,'поселок Шумилово',242,4),(301,'поселок Южный',242,4),(302,'Жигаловский район',2,3),(303,'село Байдоново',302,4),(304,'деревня Балахня',302,4),(305,'деревня Балыхта',302,4),(306,'деревня Бачай',302,4),(307,'деревня Бутырина',302,4),(308,'деревня Воробьева',302,4),(309,'деревня Головновка',302,4),(310,'деревня Головское',302,4),(311,'поселок Грехова',302,4),(312,'деревня Грузновка',302,4),(313,'село Дальняя Закора',302,4),(314,'поселок Заплескино',302,4),(315,'деревня Захарова',302,4),(316,'село Знаменка',302,4),(317,'деревня Игжиновка',302,4),(318,'деревня Кайдакан',302,4),(319,'село Качень',302,4),(320,'деревня Келора',302,4),(321,'село Коношаново',302,4),(322,'деревня Константиновка',302,4),(323,'деревня Кузнецовка',302,4),(324,'село Лукиново',302,4),(325,'посёлок Молодёжный',302,4),(326,'деревня Нижняя Слобода',302,4),(327,'деревня Орловка',302,4),(328,'село Петрово',302,4),(329,'деревня Пономарева',302,4),(330,'деревня Пуляевщина',302,4),(331,'село Рудовка',302,4),(332,'село Тимошино',302,4),(333,'село Тутура',302,4),(334,'деревня Тыпта',302,4),(335,'село Усть-Илга',302,4),(336,'село Чикан',302,4),(337,'деревня Чичек',302,4),(338,'деревня Якимовка',302,4),(339,'поселок городского типа Жигалово',2,3),(340,'Заларинский район',2,3),(341,'село Бабагай',340,4),(342,'деревня Багантуй',340,4),(343,'село Бажир',340,4),(344,'деревня Березкина',340,4),(345,'участок Благодатный',340,4),(346,'деревня Большая Заимка',340,4),(347,'деревня Большой Карлук',340,4),(348,'деревня Бухарова',340,4),(349,'село Веренка',340,4),(350,'участок Верхний',340,4),(351,'село Владимир',340,4),(352,'деревня Горячий Ключ',340,4),(353,'участок Дагник',340,4),(354,'поселок при станции Делюр',340,4),(355,'деревня Дмитриевка',340,4),(356,'участок Жизневка',340,4),(357,'деревня Заблагар',340,4),(358,'заимка Замазчикова',340,4),(359,'село Илганское',340,4),(360,'деревня Исаковка',340,4),(361,'деревня Каратаева',340,4),(362,'участок Кирхай',340,4),(363,'деревня Корсунгай',340,4),(364,'деревня Красное Поле (Тарасова)',340,4),(365,'деревня Ленденева',340,4),(366,'посёлок городского типа Тыреть 1-я',340,4),(367,'заимка Мамуркова',366,5),(368,'участок Мариинск',340,4),(369,'поселок Мейеровка',340,4),(370,'деревня Минеева',340,4),(371,'село Моисеевка',340,4),(372,'село Мойган',340,4),(373,'деревня Московская',340,4),(374,'поселок Мостовка',340,4),(375,'деревня Муруй',340,4),(376,'поселок Мягчинский',340,4),(377,'участок Николаевский',340,4),(378,'деревня Новометелкина',340,4),(379,'село Новочеремхово',340,4),(380,'деревня Окинские Сачки',340,4),(381,'участок Первое Мая',340,4),(382,'участок Пихтинский',340,4),(383,'участок Правый Сарам',340,4),(384,'участок Ремезовский',340,4),(385,'деревня Романенкина',340,4),(386,'деревня Романова',340,4),(387,'село Семёновское',340,4),(388,'деревня Сенная Падь',340,4),(389,'деревня Сорты',340,4),(390,'участок Среднепихтинский',340,4),(391,'деревня Тагна',340,4),(392,'участок Таёжный',340,4),(393,'село Троицк',340,4),(394,'деревня Тунгуй',340,4),(395,'деревня Тыреть 2-я',340,4),(396,'деревня Халты',340,4),(397,'блок-пост Халярты',340,4),(398,'село Ханжиново',340,4),(399,'деревня Харагун',340,4),(400,'село Холмогой',340,4),(401,'посёлок Хор-Бутырина',340,4),(402,'село Хор-Тагна',340,4),(403,'деревня Хотхор',340,4),(404,'деревня Чаданова',340,4),(405,'село Черемшанка',340,4),(406,'заимка Шабалина',340,4),(407,'поселок Шарагул-Сачки',340,4),(408,'деревня Щеглаева',340,4),(409,'заимка Щербакова',340,4),(410,'посёлок городского типа Залари',2,3),(411,'Зиминский район',2,3),(412,'село Баргадай (Кяхта;Обуздина)',411,4),(413,'село Басалаевка',411,4),(414,'село Батама',411,4),(415,'поселок Большеворонежский',411,4),(416,'участок Большелихачевский',411,4),(417,'поселок Большерастягаевский',411,4),(418,'участок Боровое',411,4),(419,'участок Буринская Дача',411,4),(420,'село Буря',411,4),(421,'участок Верхнеокинский',411,4),(422,'село Верхний Щельбей',411,4),(423,'деревня Верхняя Зима',411,4),(424,'село Глинки',411,4),(425,'село Зулумай',411,4),(426,'деревня Игнай',411,4),(427,'село Кимильтей',411,4),(428,'село Кундулун',411,4),(429,'деревня Кустова',411,4),(430,'село Масляногорск',411,4),(431,'участок Мольта',411,4),(432,'деревня Мордино',411,4),(433,'деревня Нагишкина',411,4),(434,'деревня Нижнечиркина',411,4),(435,'деревня Нижний Хазан',411,4),(436,'село Новолетники',411,4),(437,'деревня Новоникольск',411,4),(438,'деревня Норы',411,4),(439,'блок-пост Ока 2-я',411,4),(440,'поселок Осиповский',411,4),(441,'поселок Перевоз',411,4),(442,'село Перевоз',411,4),(443,'деревня Подгорная',411,4),(444,'село Покровка',411,4),(445,'заимка Полковникова',411,4),(446,'село Самара',411,4),(447,'село Сологубово',411,4),(448,'участок Стибутовский',411,4),(449,'участок Трактовый',411,4),(450,'участок Урункуй',411,4),(451,'село Услон',411,4),(452,'поселок Успенский 1-й',411,4),(453,'поселок Успенский 3-й',411,4),(454,'село Ухтуй',411,4),(455,'участок Феофановский',411,4),(456,'село Филипповск',411,4),(457,'село Харайгун',411,4),(458,'участок Холы',411,4),(459,'поселок Центральный Хазан',411,4),(460,'деревня Челяба',411,4),(461,'деревня Черемшанка',411,4),(462,'Казачинско-Ленский район',2,3),(463,'село Верхнемартыново (Закурья)',462,4),(464,'деревня Вершина Ханды (Ханда)',462,4),(465,'село Карам',462,4),(466,'Ключевское муниципальное образование',462,4),(467,'деревня Ключи',466,5),(468,'деревня Мостовая',466,5),(469,'Новосёловское муниципальное образование',462,4),(470,'деревня Конец Луг',469,5),(471,'поселок Окунайский',469,5),(472,'рабочий посёлок Кунерма',462,4),(473,'село Кутима',462,4),(474,'Магистральнинское муниципальное образование',462,4),(475,'рабочий посёлок Магистральный',474,5),(476,'деревня Седанкина',474,5),(477,'поселок Небель',462,4),(478,'деревня Нижнемартыново',462,4),(479,'село Новоселово',462,4),(480,'Ульканское муниципальное образование',462,4),(481,'село Тарасово',480,5),(482,'деревня Юхта',480,5),(483,'рабочий посёлок Улькан',462,4),(484,'Казачинское муниципальное образование',2,3),(485,'село Ермаки',484,4),(486,'деревня Карнаухова',484,4),(487,'деревня Коротково',484,4),(488,'село Осиново',484,4),(489,'деревня Поперечная',484,4),(490,'село Казачинское',2,3),(491,'Катангский район',2,3),(492,'село Бур',491,4),(493,'деревня Верхне-Калинина',491,4),(494,'село Ербогачен',491,4),(495,'село Ерема',491,4),(496,'село Ика',491,4),(497,'участок Инаригда',491,4),(498,'деревня Мога',491,4),(499,'село Наканно',491,4),(500,'село Непа',491,4),(501,'село Оськино',491,4),(502,'село Подволошино',491,4),(503,'село Преображенка',491,4),(504,'деревня Тетея (Сосна)',491,4),(505,'село Токма',491,4),(506,'село Хамакар',491,4),(507,'Качугский район',2,3),(508,'деревня Алексеевка',507,4),(509,'село Анга',507,4),(510,'деревня Аргун',507,4),(511,'деревня Ацикяк',507,4),(512,'село Белоусово',507,4),(513,'село Бирюлька',507,4),(514,'деревня Болото',507,4),(515,'село Большая Тарель',507,4),(516,'деревня Большедворова',507,4),(517,'деревня Большие Голы',507,4),(518,'деревня Большой Косогол',507,4),(519,'деревня Большой Улун',507,4),(520,'деревня Босогол',507,4),(521,'деревня Буредай',507,4),(522,'село Бутаково',507,4),(523,'село Верхоленск',507,4),(524,'село Вершина Тутуры',507,4),(525,'деревня Гогон',507,4),(526,'деревня Дурутуй',507,4),(527,'деревня Житова',507,4),(528,'деревня Загулан',507,4),(529,'село Залог',507,4),(530,'село Заречное',507,4),(531,'деревня Зуева',507,4),(532,'деревня Исеть',507,4),(533,'деревня Ихинагуй',507,4),(534,'село Карлук',507,4),(535,'деревня Картухай',507,4),(536,'деревня Кистенева',507,4),(537,'село Козлово',507,4),(538,'деревня Копцыгай',507,4),(539,'деревня Копылова',507,4),(540,'деревня Корсукова',507,4),(541,'деревня Краснояр',507,4),(542,'деревня Кузнецы',507,4),(543,'деревня Кукуй',507,4),(544,'деревня Куницына',507,4),(545,'посёлок Лесной',507,4),(546,'деревня Литвинова',507,4),(547,'деревня Магдан',507,4),(548,'деревня Макрушина',507,4),(549,'деревня Малая Тарель',507,4),(550,'деревня Малые Голы',507,4),(551,'село Манзурка',507,4),(552,'село Мыс',507,4),(553,'село Никилей',507,4),(554,'деревня Новохарбатова',507,4),(555,'деревня Обхой',507,4),(556,'деревня Подкаменка',507,4),(557,'деревня Полоскова',507,4),(558,'деревня Ремизова',507,4),(559,'деревня Рыкова',507,4),(560,'деревня Сутай',507,4),(561,'деревня Суханай-Байбет',507,4),(562,'деревня Тальма',507,4),(563,'деревня Тарай',507,4),(564,'деревня Тимирязева',507,4),(565,'деревня Толмачева',507,4),(566,'деревня Тырка',507,4),(567,'деревня Тюменцева',507,4),(568,'деревня Усть-Тальма',507,4),(569,'деревня Хабардина',507,4),(570,'деревня Хальск',507,4),(571,'село Харбатово',507,4),(572,'поселок Хобанова',507,4),(573,'деревня Чанчур',507,4),(574,'деревня Челпанова',507,4),(575,'деревня Чемякина',507,4),(576,'деревня Чептыхой',507,4),(577,'деревня Чинонга',507,4),(578,'деревня Шевыкан',507,4),(579,'деревня Шеина',507,4),(580,'деревня Шеметова',507,4),(581,'деревня Шишкина',507,4),(582,'деревня Щапова',507,4),(583,'деревня Юшина',507,4),(584,'рабочий посёлок Качуг',2,3),(585,'Киренский район',2,3),(586,'деревня Алексеевка',585,4),(587,'рабочий посёлок Алексеевск',585,4),(588,'село Алымовка',585,4),(589,'деревня Балышева',585,4),(590,'село Банщиково',585,4),(591,'деревня Бор',585,4),(592,'деревня Верхнекарелина',585,4),(593,'деревня Верхолугск',585,4),(594,'поселок Визирный',585,4),(595,'деревня Вишнякова',585,4),(596,'посёлок Воронежский',585,4),(597,'деревня Дарьина',585,4),(598,'деревня Заборье',585,4),(599,'село Змеиново',585,4),(600,'поселок Золотой',585,4),(601,'деревня Ичера',585,4),(602,'деревня Коммуна',585,4),(603,'деревня Кондрашина',585,4),(604,'село Коршуново',585,4),(605,'село Красноярово',585,4),(606,'село Кривая Лука',585,4),(607,'село Кривошапкино',585,4),(608,'село Макарово',585,4),(609,'село Мироново',585,4),(610,'деревня Мутина',585,4),(611,'поселок Небель',585,4),(612,'деревня Никольск',585,4),(613,'деревня Никулина',585,4),(614,'деревня Орлова',585,4),(615,'поселок Пашня',585,4),(616,'село Петропавловское',585,4),(617,'деревня Подъельник',585,4),(618,'деревня Салтыкова',585,4),(619,'деревня Сидорова',585,4),(620,'деревня Скобельская',585,4),(621,'село Сполошино',585,4),(622,'деревня Старая Деревня (Повороты)',585,4),(623,'село Улькан',585,4),(624,'село Усть-Киренга',585,4),(625,'деревня Хабарова',585,4),(626,'деревня Частых',585,4),(627,'село Чечуйск',585,4),(628,'посёлок Юбилейный',585,4),(629,'Киренск',2,3),(630,'Куйтунский район',2,3),(631,'деревня Александро-Невская Станица',630,4),(632,'село Александро-Невский Завод',630,4),(633,'село Алкин',630,4),(634,'село Амур',630,4),(635,'село Андрюшино',630,4),(636,'деревня Апраксина',630,4),(637,'деревня Аршан',630,4),(638,'поселок Ахтинский',630,4),(639,'село Барлук',630,4),(640,'поселок Березовский',630,4),(641,'село Большой Кашелак',630,4),(642,'село Броды',630,4),(643,'поселок Бузулук',630,4),(644,'село Бурук',630,4),(645,'посёлок Еланский',630,4),(646,'село Заваль',630,4),(647,'поселок Зобинский',630,4),(648,'участок Ивановский',630,4),(649,'поселок Игнино',630,4),(650,'село Или',630,4),(651,'село Каразей',630,4),(652,'село Каранцай',630,4),(653,'село Карымск',630,4),(654,'поселок при станции Кимильтей',630,4),(655,'село Ключи',630,4),(656,'деревня Красный Яр (Подьяр)',630,4),(657,'село Кундуй',630,4),(658,'посёлок Ленинский',630,4),(659,'поселок Лермонтовский',630,4),(660,'деревня Листвянка',630,4),(661,'поселок Майский',630,4),(662,'село Малая Кочерма',630,4),(663,'участок Малой',630,4),(664,'деревня Меньчукова',630,4),(665,'село Мингатуй',630,4),(666,'поселок ж.-д. ст. Мингатуй',630,4),(667,'поселок Наратай',630,4),(668,'деревня Новая Када',630,4),(669,'поселок Новая Тельба',630,4),(670,'поселок Новокадинский',630,4),(671,'поселок Новые Броды',630,4),(672,'поселок Окинский',630,4),(673,'поселок Октябрьский',630,4),(674,'поселок Панагино',630,4),(675,'деревня Полтава',630,4),(676,'деревня Ромоданова',630,4),(677,'посёлок Садовый',630,4),(678,'посёлок Сосновский',630,4),(679,'деревня Станица 3-я',630,4),(680,'поселок Степной',630,4),(681,'село Сулкет',630,4),(682,'деревня Таган',630,4),(683,'село Тихорут',630,4),(684,'деревня Тобино',630,4),(685,'село Тулюшка',630,4),(686,'посёлок железнодорожной станции Тулюшка',630,4),(687,'село Усть-Када',630,4),(688,'поселок Уховский',630,4),(689,'село Уян',630,4),(690,'село Хаихта',630,4),(691,'деревня Ханхатуй',630,4),(692,'поселок Харик',630,4),(693,'село Харик',630,4),(694,'деревня Харчев',630,4),(695,'село Чеботариха',630,4),(696,'деревня Широкие Кочки',630,4),(697,'рабочий посёлок Куйтун',2,3),(698,'Мамско-Чуйский район',2,3),(699,'поселок Большой Северный',698,4),(700,'рабочий посёлок Витимский',698,4),(701,'поселок Воронцовка',698,4),(702,'поселок Заря',698,4),(703,'поселок Колотовка',698,4),(704,'рабочий посёлок Луговский',698,4),(705,'рабочий посёлок Мама',698,4),(706,'поселок Мусковит',698,4),(707,'поселок Слюдянка',698,4),(708,'посёлок Тетеринск',698,4),(709,'село Чуя',698,4),(710,'Нижнеилимский район',2,3),(711,'поселок Березняки',710,4),(712,'поселок Брусничный',710,4),(713,'рабочий посёлок Видим',710,4),(714,'посёлок Дальний',710,4),(715,'поселок Заморский',710,4),(716,'поселок Заярск',710,4),(717,'поселок Игирма',710,4),(718,'поселок Каймоновский',710,4),(719,'деревня Карстовая',710,4),(720,'поселок Коршуновский',710,4),(721,'поселок Мерзлотная',710,4),(722,'поселок Миндей 1-й',710,4),(723,'поселок Миндей 2-й',710,4),(724,'рабочий посёлок Новая Игирма',710,4),(725,'поселок Новоилимск',710,4),(726,'рабочий посёлок Радищев',710,4),(727,'поселок Речушка',710,4),(728,'рабочий посёлок Рудногорск',710,4),(729,'посёлок железнодорожной станции Селезнёво',710,4),(730,'поселок Селезневский',710,4),(731,'поселок Семигорск',710,4),(732,'участок Сохатый',710,4),(733,'посёлок Соцгородок',710,4),(734,'поселок Суворовский',710,4),(735,'рабочий посёлок Хребтовая',710,4),(736,'посёлок при станции Чёрная',710,4),(737,'поселок Чистополянский',710,4),(738,'рабочий посёлок Шестаково',710,4),(739,'рабочий посёлок Янгель',710,4),(740,'Железногорск-Илимский',2,3),(741,'Нижнеудинский район',2,3),(742,'Усть-Рубахинское муниципальное образование',741,4),(743,'село Абалаково',742,5),(744,'посёлок Вознесенский',742,5),(745,'поселок Майский',742,5),(746,'село Мельница',742,5),(747,'деревня Муксут',742,5),(748,'посёлок Подгорный',742,5),(749,'деревня Рубахина',742,5),(750,'деревня Уват',742,5),(751,'деревня Швайкина',742,5),(752,'деревня Шум',742,5),(753,'Замзорское муниципальное образование',741,4),(754,'посёлок Алгашет',753,5),(755,'участок Загорье',753,5),(756,'участок Косой Брод',753,5),(757,'посёлок Первомайский (Алгашет)',753,5),(758,'деревня Старый Замзор',753,5),(759,'Алзамайское муниципальное образование',741,4),(760,'Алзамай',759,5),(761,'Тофаларское муниципальное образование',741,4),(762,'село Алыгджер',761,5),(763,'Атагайское муниципальное образование',741,4),(764,'рабочий посёлок Атагай',763,5),(765,'деревня Казачья Бадарановка',763,5),(766,'деревня Каксат',763,5),(767,'посёлок Лесной',763,5),(768,'участок Октябрьский',763,5),(769,'деревня Укар',763,5),(770,'деревня Ук-Бадарановка',763,5),(771,'поселок Усть-Кадуй',763,5),(772,'деревня Шипицина',763,5),(773,'Шебертинское муниципальное образование',741,4),(774,'деревня Большеверстовск',773,5),(775,'участок Варяг',773,5),(776,'поселок Вершина',773,5),(777,'село Даур',773,5),(778,'поселок железнодорожной станции Шеберта',773,5),(779,'Широковское муниципальное образование',741,4),(780,'село Боровинок',779,5),(781,'деревня Зенцова',779,5),(782,'деревня Тони',779,5),(783,'поселок Черемшанка',779,5),(784,'Катарбейское муниципальное образование',741,4),(785,'деревня Бородинск',784,5),(786,'деревня Миллерова',784,5),(787,'деревня Орик',784,5),(788,'деревня Унгудул',784,5),(789,'деревня Ут',784,5),(790,'Староалзамайское муниципальное образование',741,4),(791,'посёлок Буракова',790,5),(792,'деревня Красная Кавалерия',790,5),(793,'посёлок Новокиевск',790,5),(794,'Худоеланское муниципальное образование',741,4),(795,'деревня Верхний Хингуй',794,5),(796,'поселок железнодорожной станции Кадуй',794,5),(797,'деревня Кадуй',794,5),(798,'деревня Талый Ключ',794,5),(799,'поселок железнодорожной станции Хингуй',794,5),(800,'село Верхняя Гутара',741,4),(801,'Иргейское муниципальное образование',741,4),(802,'деревня Виленск',801,5),(803,'деревня Марга',801,5),(804,'Уковское муниципальное образование',741,4),(805,'поселок Водопадный',804,5),(806,'участок Игнит',804,5),(807,'поселок Камышет',804,5),(808,'рабочий посёлок Ук',804,5),(809,'Чеховское муниципальное образование',741,4),(810,'деревня Волчий Брод',809,5),(811,'деревня Катын',809,5),(812,'деревня Кургатей',809,5),(813,'деревня Мунтубулук',809,5),(814,'Катарминское муниципальное образование',741,4),(815,'деревня Гродинск',814,5),(816,'участок Новогродинск',814,5),(817,'участок Таёжный',814,5),(818,'посёлок Замзор',741,4),(819,'деревня Заречье',741,4),(820,'село Иргей',741,4),(821,'село Каменка',741,4),(822,'село Катарбей',741,4),(823,'село Катарма',741,4),(824,'Порогское муниципальное образование',741,4),(825,'посёлок Кирей-Муксут',824,5),(826,'деревня Привольное',824,5),(827,'участок Пушкинский',824,5),(828,'посёлок Костино',741,4),(829,'Каменское муниципальное образование',741,4),(830,'участок Куряты',829,5),(831,'деревня Мара',829,5),(832,'деревня Новое Село (Большой Курят)',829,5),(833,'участок Яга',829,5),(834,'Солонецкое муниципальное образование',741,4),(835,'деревня Кушун',834,5),(836,'деревня Чалоты',834,5),(837,'деревня Нерха',741,4),(838,'село Порог',741,4),(839,'село Солонцы',741,4),(840,'село Старый Алзамай',741,4),(841,'село Худоеланское',741,4),(842,'село Чехово',741,4),(843,'село Шеберта',741,4),(844,'село Широково',741,4),(845,'Шумское муниципальное образование',741,4),(846,'рабочий посёлок Шумский',845,5),(847,'Нижнеудинск',2,3),(848,'Нукутский район',2,3),(849,'село Алтарик',848,4),(850,'деревня Большебаяновская',848,4),(851,'деревня Большепобединская',848,4),(852,'деревня Васильевское',848,4),(853,'деревня Ворот-Онгой',848,4),(854,'поселок Дружный',848,4),(855,'деревня Ей',848,4),(856,'деревня Задоновская',848,4),(857,'село Закулей',848,4),(858,'посёлок Заречный',848,4),(859,'деревня Заходы',848,4),(860,'деревня Зунгар',848,4),(861,'деревня Кирилловская',848,4),(862,'деревня Куйта',848,4),(863,'деревня Макарьевская',848,4),(864,'деревня Малая Сухая',848,4),(865,'поселок Мельхитуй',848,4),(866,'деревня Наймодай',848,4),(867,'поселок Новоленино',848,4),(868,'поселок Новонукутский',848,4),(869,'деревня Новоселова',848,4),(870,'село Нукуты',848,4),(871,'село Первомайское',848,4),(872,'деревня Саган-Жалгай',848,4),(873,'поселок Степное',848,4),(874,'деревня Тангуты',848,4),(875,'деревня Татхал-Онгой',848,4),(876,'деревня Ункурлик',848,4),(877,'село Хадахан',848,4),(878,'деревня Хамхар',848,4),(879,'село Хареты',848,4),(880,'поселок Целинный',848,4),(881,'деревня Чичиковская',848,4),(882,'деревня Шалоты',848,4),(883,'деревня Шарагул',848,4),(884,'село Шараты',848,4),(885,'Ольхонский район',2,3),(886,'деревня Алагуй',885,4),(887,'деревня Баганта',885,4),(888,'заимка Борсой',885,4),(889,'поселок Бугульдейка',885,4),(890,'деревня Бутухей',885,4),(891,'село Еланцы',885,4),(892,'деревня Зама',885,4),(893,'село Косая Степь',885,4),(894,'деревня Кочерикова',885,4),(895,'деревня Куреть',885,4),(896,'деревня Куркут',885,4),(897,'деревня Курма',885,4),(898,'деревня Куртун',885,4),(899,'деревня Кучулга',885,4),(900,'деревня Куяда',885,4),(901,'деревня Малый Хужир',885,4),(902,'деревня Мухор-Булык',885,4),(903,'деревня Нарин-Кунта',885,4),(904,'село Онгурен',885,4),(905,'посёлок Песчаная',885,4),(906,'деревня Петрова',885,4),(907,'деревня Попова',885,4),(908,'деревня Сарма',885,4),(909,'село Сахюрта',885,4),(910,'деревня Таловка',885,4),(911,'деревня Тонта',885,4),(912,'деревня Тырган',885,4),(913,'поселок Узуры',885,4),(914,'заимка Улан-Нур',885,4),(915,'заимка Усык',885,4),(916,'деревня Хадай',885,4),(917,'деревня Халгай (Улан-Хушин)',885,4),(918,'деревня Халха-Узур',885,4),(919,'деревня Харанцы',885,4),(920,'участок Хархатай',885,4),(921,'посёлок Хужир',885,4),(922,'деревня Хурай-Нур',885,4),(923,'село Шара-Тогот (Черноруд)',885,4),(924,'поселок Шида',885,4),(925,'деревня Ялга',885,4),(926,'заимка Ялга-Узур',885,4),(927,'Осинский район',2,3),(928,'деревня Абрамовка (Пахаленская)',927,4),(929,'деревня Батхай',927,4),(930,'село Бильчир',927,4),(931,'деревня Борохал',927,4),(932,'деревня Горхон',927,4),(933,'деревня Грязнушка',927,4),(934,'село Енисей (Бурятский Янгут)',927,4),(935,'поселок Жданово',927,4),(936,'деревня Заглик',927,4),(937,'село Ирхидей',927,4),(938,'село Каха',927,4),(939,'деревня Кутанка',927,4),(940,'село Ново-Ленино',927,4),(941,'деревня Лузгина',927,4),(942,'село Майск',927,4),(943,'деревня Малаханова',927,4),(944,'деревня Марковка',927,4),(945,'деревня Моголют',927,4),(946,'деревня Мороза',927,4),(947,'село Обуса',927,4),(948,'деревня Онгой',927,4),(949,'деревня Онгосор',927,4),(950,'село Оса',927,4),(951,'поселок Приморский',927,4),(952,'деревня Прохоровка',927,4),(953,'поселок Рассвет',927,4),(954,'деревня Русские Янгуты',927,4),(955,'поселок Северный',927,4),(956,'деревня Табатай',927,4),(957,'деревня Тагай',927,4),(958,'село Унгин',927,4),(959,'село Усть-Алтан',927,4),(960,'деревня Хайга',927,4),(961,'деревня Харай',927,4),(962,'село Хокта',927,4),(963,'деревня Чупровка',927,4),(964,'деревня Шотой',927,4),(965,'Слюдянский район',2,3),(966,'Култукское муниципальное образование',965,4),(967,'посёлок железнодорожной станции Ангасолка',966,5),(968,'поселок Ангасольская',966,5),(969,'поселок железнодорожной станции Андрияновская',966,5),(970,'поселок Широкая',966,5),(971,'Утуликское муниципальное образование',965,4),(972,'поселок Бабха',971,5),(973,'посёлок Мангутай',971,5),(974,'посёлок Муравей',971,5),(975,'поселок Орехово',971,5),(976,'поселок Байкал (порт)',965,4),(977,'Байкальское муниципальное образование',965,4),(978,'Байкальск',977,5),(979,'поселок Осиновка',977,5),(980,'поселок Солзан',977,5),(981,'Маритуйское муниципальное образование',965,4),(982,'поселок Баклань',981,5),(983,'поселок Половинная',981,5),(984,'посёлок Пономарёвка',981,5),(985,'посёлок Пыловка',981,5),(986,'поселок Уланово',981,5),(987,'поселок Шаражалгай',981,5),(988,'поселок Шумиха',981,5),(989,'деревня Быстрая',965,4),(990,'рабочий посёлок Култук',965,4),(991,'село Маритуй',965,4),(992,'Новоснежнинское муниципальное образование',965,4),(993,'посёлок Мурино',992,5),(994,'поселок Паньковка 1-я',992,5),(995,'поселок Паньковка 2-я',992,5),(996,'поселок Новоснежная',965,4),(997,'Быстринское муниципальное образование',965,4),(998,'село Тибельти',997,5),(999,'посёлок Утулик',965,4),(1000,'Слюдянское муниципальное образование',2,3),(1001,'посёлок Буровщина',1000,4),(1002,'поселок Сухой Ручей',1000,4),(1003,'Слюдянка',2,3),(1004,'Тайшетский район',2,3),(1005,'село Авдюшино',1004,4),(1006,'поселок ж.-д. ст. Акульшет',1004,4),(1007,'деревня Байроновка',1004,4),(1008,'село Березовка',1004,4),(1009,'село Бирюса',1004,4),(1010,'Бирюсинск',1004,4),(1011,'деревня Благодатское',1004,4),(1012,'село Борисово',1004,4),(1013,'хутор Борок',1004,4),(1014,'село Бузыканово',1004,4),(1015,'поселок Венгерка',1004,4),(1016,'поселок Гавань',1004,4),(1017,'деревня Георгиевка',1004,4),(1018,'посёлок железнодорожной станции Горевая',1004,4),(1019,'село Джогино',1004,4),(1020,'деревня Еловое',1004,4),(1021,'деревня Енисейка',1004,4),(1022,'поселок железнодорожной станции Запань',1004,4),(1023,'село Заречное',1004,4),(1024,'деревня Зыряновка',1004,4),(1025,'деревня Иванов Мыс',1004,4),(1026,'деревня Ингашет',1004,4),(1027,'деревня Камышлеевка',1004,4),(1028,'рабочий посёлок Квиток',1004,4),(1029,'село Кондратьево',1004,4),(1030,'деревня Коновалова',1004,4),(1031,'село Конторка',1004,4),(1032,'село Короленко',1004,4),(1033,'поселок ж.-д. ст. Костомарово',1004,4),(1034,'деревня Малиновка',1004,4),(1035,'село Мирный',1004,4),(1036,'поселок ж.-д. ст. Невельская',1004,4),(1037,'деревня Нижняя Гоголевка',1004,4),(1038,'село Нижняя Заимка',1004,4),(1039,'село Николаевка',1004,4),(1040,'рабочий посёлок Новобирюсинский',1004,4),(1041,'поселок Новотремино',1004,4),(1042,'деревня Новошелехова',1004,4),(1043,'деревня Новый Акульшет',1004,4),(1044,'поселок железнодорожной станции Облепиха',1004,4),(1045,'деревня Парижская Коммуна',1004,4),(1046,'поселок Пея',1004,4),(1047,'урочище Пойма',1004,4),(1048,'деревня Покровка',1004,4),(1049,'поселок Полинчет',1004,4),(1050,'село Половино-Черемхово',1004,4),(1051,'деревня Пуляева',1004,4),(1052,'поселок ж.-д. ст. Разгон',1004,4),(1053,'село Рождественка',1004,4),(1054,'деревня Рыбинск',1004,4),(1055,'село Саранчет 1-й',1004,4),(1056,'поселок ж/д станции Саранчет 2-й',1004,4),(1057,'деревня Сафроновка',1004,4),(1058,'деревня Серафимовка',1004,4),(1059,'деревня Сергина',1004,4),(1060,'поселок Сереброво',1004,4),(1061,'деревня Синякина',1004,4),(1062,'поселок Соляная',1004,4),(1063,'деревня Старошелехова',1004,4),(1064,'село Старый Акульшет',1004,4),(1065,'село Талая',1004,4),(1066,'поселок железнодорожной станции Тамтачет',1004,4),(1067,'деревня Тимирязева',1004,4),(1068,'участок Тинская Дача',1004,4),(1069,'поселок ж.-д. ст. Топорок',1004,4),(1070,'посёлок Точильный',1004,4),(1071,'деревня Тракт-Кавказ',1004,4),(1072,'деревня Тракт-Ужет',1004,4),(1073,'деревня Тремина',1004,4),(1074,'деревня Троицк',1004,4),(1075,'деревня Туманшет',1004,4),(1076,'поселок ж/д станции Туманшет',1004,4),(1077,'посёлок Урало-Ключи',1004,4),(1078,'деревня Черемшанка',1004,4),(1079,'поселок ж.-д. ст. Черманчет',1004,4),(1080,'село Черчет',1004,4),(1081,'деревня Шевченко',1004,4),(1082,'село Шелаево',1004,4),(1083,'село Шелехово',1004,4),(1084,'деревня Шемякина',1004,4),(1085,'рабочий посёлок Шиткино',1004,4),(1086,'рабочий посёлок Юрты',1004,4),(1087,'деревня Яковская',1004,4),(1088,'Тайшет',2,3),(1089,'Тулунский район',2,3),(1090,'поселок 1-е отделение Государственной селекционной станции',1089,4),(1091,'поселок 4-е отделение Государственной селекционной станции',1089,4),(1092,'деревня Аверьяновка',1089,4),(1093,'деревня Азей',1089,4),(1094,'село Азей',1089,4),(1095,'село Алгатуй',1089,4),(1096,'деревня Александровка',1089,4),(1097,'деревня Альбин',1089,4),(1098,'деревня Ангуй',1089,4),(1099,'поселок Ангуйский',1089,4),(1100,'деревня Андреевка',1089,4),(1101,'поселок Аршан',1089,4),(1102,'деревня Афанасьева',1089,4),(1103,'село Бадар',1089,4),(1104,'поселок Белая Зима',1089,4),(1105,'деревня Большой Одер',1089,4),(1106,'деревня Боробино',1089,4),(1107,'село Будагово',1089,4),(1108,'деревня Булюшкина',1089,4),(1109,'село Бурхун',1089,4),(1110,'поселок Буслайка-Ангуйская',1089,4),(1111,'деревня Верхний Бурбук',1089,4),(1112,'деревня Верхний Манут',1089,4),(1113,'деревня Владимировка',1089,4),(1114,'деревня Вознесенск',1089,4),(1115,'село Гадалей',1089,4),(1116,'село Галдун',1089,4),(1117,'деревня Гарбакарай',1089,4),(1118,'село Гуран',1089,4),(1119,'деревня Евдокимова',1089,4),(1120,'поселок Евдокимовский (Городок)',1089,4),(1121,'село Едогон',1089,4),(1122,'поселок Ермаки',1089,4),(1123,'деревня Забор',1089,4),(1124,'деревня Заусаева',1089,4),(1125,'деревня Изегол',1089,4),(1126,'село Икей',1089,4),(1127,'поселок Икейский',1089,4),(1128,'деревня Ингут',1089,4),(1129,'поселок Иннокентьевский',1089,4),(1130,'посёлок Ишидей',1089,4),(1131,'деревня Казакова',1089,4),(1132,'деревня Килим',1089,4),(1133,'поселок Ключевой',1089,4),(1134,'деревня Козухум',1089,4),(1135,'село Котик',1089,4),(1136,'деревня Красная Дубрава',1089,4),(1137,'участок Красноозерский',1089,4),(1138,'деревня Красный Октябрь',1089,4),(1139,'деревня Кривуша',1089,4),(1140,'деревня Малый Утайчик',1089,4),(1141,'село Мугун',1089,4),(1142,'деревня Натка',1089,4),(1143,'деревня Нижний Бурбук',1089,4),(1144,'деревня Нижний Манут',1089,4),(1145,'село Никитаево',1089,4),(1146,'деревня Ниргит',1089,4),(1147,'деревня Новая Деревня',1089,4),(1148,'деревня Новотроицк',1089,4),(1149,'деревня Нюра',1089,4),(1150,'деревня Одон',1089,4),(1151,'поселок Октябрьский 1-й',1089,4),(1152,'поселок Октябрьский 2-й',1089,4),(1153,'деревня Паберега',1089,4),(1154,'деревня Павловка',1089,4),(1155,'село Перфилово',1089,4),(1156,'деревня Петровск',1089,4),(1157,'деревня Северный Кадуй',1089,4),(1158,'поселок Сибиряк',1089,4),(1159,'деревня Талхан',1089,4),(1160,'деревня Трактовая',1089,4),(1161,'деревня Трактово-Курзан',1089,4),(1162,'село Уйгат',1089,4),(1163,'село Умыган',1089,4),(1164,'село Усть-Кульск',1089,4),(1165,'поселок Утай',1089,4),(1166,'деревня Уталай',1089,4),(1167,'деревня Хараманут',1089,4),(1168,'деревня Харантей',1089,4),(1169,'деревня Харгажин',1089,4),(1170,'поселок Целинные Земли',1089,4),(1171,'поселок Центральные Мастерские',1089,4),(1172,'село Шерагул',1089,4),(1173,'посёлок железнодорожной станции Шуба',1089,4),(1174,'деревня Южный Кадуй',1089,4),(1175,'Усольский район',2,3),(1176,'Сосновское муниципальное образование',1175,4),(1177,'деревня Арансахой',1176,5),(1178,'поселок Белогорск',1176,5),(1179,'Большееланское муниципальное образование',1175,4),(1180,'деревня Архиереевка',1179,5),(1181,'село Большая Елань',1179,5),(1182,'деревня Большежилкина',1179,5),(1183,'заимка Калиновка',1179,5),(1184,'деревня Низовцева',1179,5),(1185,'заимка Новоясачная',1179,5),(1186,'село Целоты',1179,5),(1187,'Новомальтинское сельское поселение',1175,4),(1188,'деревня Бадай',1187,5),(1189,'посёлок Новомальтинск',1187,5),(1190,'рабочий посёлок Белореченский',1175,4),(1191,'Железнодорожное муниципальное образование',1175,4),(1192,'село Биликтуй',1191,5),(1193,'поселок Железнодорожный',1191,5),(1194,'деревня Китой',1191,5),(1195,'поселок Набережный',1191,5),(1196,'деревня Старая Ясачная',1191,5),(1197,'поселок ж/д. ст. Тельма',1191,5),(1198,'Раздольинское муниципальное образование',1175,4),(1199,'поселок Большая Черемшанка',1198,5),(1200,'деревня Борисова',1198,5),(1201,'поселок Манинск',1198,5),(1202,'поселок Октябрьский',1198,5),(1203,'поселок Раздолье',1198,5),(1204,'Тайтурское муниципальное образование',1175,4),(1205,'деревня Буреть',1204,5),(1206,'деревня Кочерикова',1204,5),(1207,'рабочий посёлок Тайтурка',1204,5),(1208,'село Холмушино',1204,5),(1209,'Мишелёвское муниципальное образование',1175,4),(1210,'деревня Глубокий Лог',1209,5),(1211,'рабочий посёлок Мишелёвка',1209,5),(1212,'посёлок Усолье-7',1209,5),(1213,'село Хайта',1209,5),(1214,'Тельминское муниципальное образование',1175,4),(1215,'посёлок Ершовка',1214,5),(1216,'посёлок Озёрный',1214,5),(1217,'посёлок Саннолыжный',1214,5),(1218,'деревня Сапиновка',1214,5),(1219,'рабочий посёлок Тельма',1214,5),(1220,'посёлок Тюменск',1214,5),(1221,'Новожилкинское муниципальное образование',1175,4),(1222,'деревня Ключевая',1221,5),(1223,'деревня Култук',1221,5),(1224,'село Новожилкино',1221,5),(1225,'Белореченское городское муниципальное образование',1175,4),(1226,'село Мальта',1225,5),(1227,'село Сосновка',1175,4),(1228,'Среднинское муниципальное образование',1175,4),(1229,'рабочий посёлок Средний',1228,5),(1230,'посёлок Степной',1228,5),(1231,'Тальянское муниципальное образование',1175,4),(1232,'посёлок Тальяны',1231,5),(1233,'поселок Ходарей',1231,5),(1234,'Усть-Илимский район',2,3),(1235,'поселок Бадарма',1234,4),(1236,'поселок Бадарминск',1234,4),(1237,'село Ершово',1234,4),(1238,'рабочий посёлок Железнодорожный',1234,4),(1239,'поселок Кедровый',1234,4),(1240,'поселок Ковинский',1234,4),(1241,'посёлок Невон',1234,4),(1242,'село Подъеланка',1234,4),(1243,'посёлок Седаново',1234,4),(1244,'посёлок Тубинский',1234,4),(1245,'поселок Тушама',1234,4),(1246,'посёлок Эдучанка',1234,4),(1247,'Усть-Кутский район',2,3),(1248,'посёлок Бобровка',1247,4),(1249,'село Боярск',1247,4),(1250,'посёлок Верхнемарково',1247,4),(1251,'деревня Жемчугова',1247,4),(1252,'посёлок Заярново',1247,4),(1253,'рабочий посёлок Звёздный',1247,4),(1254,'посёлок Казарки',1247,4),(1255,'село Каймоново',1247,4),(1256,'деревня Максимово',1247,4),(1257,'село Марково',1247,4),(1258,'посёлок Ния',1247,4),(1259,'деревня Новосёлова',1247,4),(1260,'село Омолой',1247,4),(1261,'село Орлинга',1247,4),(1262,'село Подымахино',1247,4),(1263,'посёлок Ручей',1247,4),(1264,'село Тарасово',1247,4),(1265,'село Таюра',1247,4),(1266,'село Турука',1247,4),(1267,'рабочий посёлок Янталь',1247,4),(1268,'Усть-Кут',2,3),(1269,'Усть-Удинский район',2,3),(1270,'село Аносово',1269,4),(1271,'село Аталанка',1269,4),(1272,'село Балаганка',1269,4),(1273,'деревня Баранова',1269,4),(1274,'поселок Бурундуйский',1269,4),(1275,'деревня Долганова',1269,4),(1276,'село Игжей',1269,4),(1277,'поселок Карда',1269,4),(1278,'деревня Кижа',1269,4),(1279,'деревня Ключи',1269,4),(1280,'деревня Лобагай',1269,4),(1281,'село Малышевка',1269,4),(1282,'деревня Михайловщина',1269,4),(1283,'село Молька',1269,4),(1284,'село Новая Уда',1269,4),(1285,'деревня Податовская',1269,4),(1286,'село Подволочное',1269,4),(1287,'село Светлолобово',1269,4),(1288,'село Средняя Муя',1269,4),(1289,'деревня Усть-Малой',1269,4),(1290,'деревня Халюты',1269,4),(1291,'деревня Чичкова',1269,4),(1292,'село Юголок',1269,4),(1293,'деревня Ясачная Хайрюзовка',1269,4),(1294,'посёлок Усть-Уда',2,3),(1295,'Черемховский район',2,3),(1296,'Алёхинское муниципальное образование',1295,4),(1297,'село Алехино',1296,5),(1298,'деревня Заморская',1296,5),(1299,'деревня Паршевникова',1296,5),(1300,'деревня Средний Булай',1296,5),(1301,'Нижнеиретское муниципальное образование',1295,4),(1302,'деревня Бажей',1301,5),(1303,'поселок Большебельск',1301,5),(1304,'заимка Гусева',1301,5),(1305,'заимка Невидимова',1301,5),(1306,'село Нижняя Иреть',1301,5),(1307,'поселок Паточный',1301,5),(1308,'заимка Шестакова',1301,5),(1309,'Каменно-Ангарское муниципальное образование',1295,4),(1310,'деревня Балухарь',1309,5),(1311,'село Каменно-Ангарск',1309,5),(1312,'Зерновское муниципальное образование',1295,4),(1313,'деревня Бархатова',1312,5),(1314,'блок-пост Витух',1312,5),(1315,'село Зерновое',1312,5),(1316,'деревня Касьяновка',1312,5),(1317,'поселок Молочное',1312,5),(1318,'деревня Петровка',1312,5),(1319,'Голуметское муниципальное образование',1295,4),(1320,'деревня Баталаева',1319,5),(1321,'деревня Верхняя Иреть',1319,5),(1322,'село Голуметь',1319,5),(1323,'деревня Елоты',1319,5),(1324,'участок Мандагай',1319,5),(1325,'поселок Полежаева',1319,5),(1326,'заимка Труженик',1319,5),(1327,'Тунгусское муниципальное образование',1295,4),(1328,'деревня Белые Ключи',1327,5),(1329,'поселок Мото-Бодары',1327,5),(1330,'село Тунгуска',1327,5),(1331,'Булайское муниципальное образование',1295,4),(1332,'деревня Белькова',1331,5),(1333,'село Верхний Булай',1331,5),(1334,'деревня Искра',1331,5),(1335,'деревня Козлова',1331,5),(1336,'деревня Протасова',1331,5),(1337,'деревня Чернухина',1331,5),(1338,'Бельское муниципальное образование',1295,4),(1339,'село Бельск',1338,5),(1340,'деревня Елань',1338,5),(1341,'деревня Ключи',1338,5),(1342,'деревня Комарова',1338,5),(1343,'деревня Лохова',1338,5),(1344,'деревня Мутовка',1338,5),(1345,'деревня Поморцева',1338,5),(1346,'Парфёновское муниципальное образование',1295,4),(1347,'деревня Гавриловская',1346,5),(1348,'деревня Герасимова',1346,5),(1349,'деревня Гымыль',1346,5),(1350,'деревня Жернакова',1346,5),(1351,'деревня Исакова',1346,5),(1352,'деревня Малая Ленская',1346,5),(1353,'деревня Мотова',1346,5),(1354,'село Парфёново',1346,5),(1355,'деревня Русская Аларь',1346,5),(1356,'деревня Савинская',1346,5),(1357,'деревня Сарапулова',1346,5),(1358,'деревня Средняя',1346,5),(1359,'деревня Сутупова',1346,5),(1360,'заимка Тарбажи',1346,5),(1361,'деревня Топка',1346,5),(1362,'деревня Тюмень',1346,5),(1363,'деревня Хорьки',1346,5),(1364,'Новостроевское муниципальное образование',1295,4),(1365,'поселок Городок',1364,5),(1366,'село Инга',1364,5),(1367,'поселок Новостройка',1364,5),(1368,'поселок Чернушка 1-я',1364,5),(1369,'поселок Чернушка 2-я',1364,5),(1370,'Новогромовское муниципальное образование',1295,4),(1371,'деревня Громова',1370,5),(1372,'деревня Забитуй',1370,5),(1373,'деревня Катом',1370,5),(1374,'деревня Малиновка',1370,5),(1375,'село Новогромово',1370,5),(1376,'заимка Ступина',1370,5),(1377,'деревня Шаманаева',1370,5),(1378,'Саянское муниципальное образование',1295,4),(1379,'деревня Жалгай',1378,5),(1380,'участок Индон',1378,5),(1381,'деревня Красный Брод',1378,5),(1382,'село Саянское',1378,5),(1383,'деревня Хандагай',1378,5),(1384,'Лоховское муниципальное образование',1295,4),(1385,'деревня Жмурова',1384,5),(1386,'село Лохово',1384,5),(1387,'деревня Нены',1384,5),(1388,'деревня Табук',1384,5),(1389,'рабочий посёлок Михайловка',1295,4),(1390,'Узколугское муниципальное образование',1295,4),(1391,'заимка Нижняя Иреть',1390,5),(1392,'село Узкий Луг',1390,5),(1393,'деревня Худорожкина',1390,5),(1394,'Онотское муниципальное образование',1295,4),(1395,'село Онот',1394,5),(1396,'деревня Ургантуй',1394,5),(1397,'Тальниковское муниципальное образование',1295,4),(1398,'поселок Сплавная',1397,5),(1399,'село Тальники',1397,5),(1400,'деревня Тунгусы',1397,5),(1401,'поселок Юлинск',1397,5),(1402,'Михайловское муниципальное образование',1295,4),(1403,'деревня Субботина',1402,5),(1404,'деревня Белобородова',2,3),(1405,'деревня Кирзавод',2,3),(1406,'деревня Муратова',2,3),(1407,'деревня Поздеева',2,3),(1408,'село Рысево',2,3),(1409,'деревня Старый Кутугун',2,3),(1410,'деревня Трактовая',2,3),(1411,'заимка Чемодариха',2,3),(1412,'деревня Шубина',2,3),(1413,'Чунский район',2,3),(1414,'село Баер',1413,4),(1415,'село Балтурино',1413,4),(1416,'поселок Бидога',1413,4),(1417,'село Бунбуй',1413,4),(1418,'село Баянда',1413,4),(1419,'поселок Веселый',1413,4),(1420,'деревня Ганькина',1413,4),(1421,'поселок Елань',1413,4),(1422,'посёлок Заводской',1413,4),(1423,'деревня Захаровка',1413,4),(1424,'посёлок Изыкан',1413,4),(1425,'поселок Каменск (Каменской)',1413,4),(1426,'поселок Кедровый',1413,4),(1427,'деревня Кулиш',1413,4),(1428,'рабочий посёлок Лесогорск',1413,4),(1429,'село Мироново',1413,4),(1430,'деревня Мухино',1413,4),(1431,'поселок Нагорный',1413,4),(1432,'деревня Неванка',1413,4),(1433,'деревня Новобалтурина',1413,4),(1434,'деревня Новочунка',1413,4),(1435,'посёлок Новочунка',1413,4),(1436,'деревня Окраина',1413,4),(1437,'рабочий посёлок Октябрьский',1413,4),(1438,'деревня Паренда',1413,4),(1439,'поселок Парчум',1413,4),(1440,'поселок Пионерский',1413,4),(1441,'деревня Питаева',1413,4),(1442,'поселок Приудинск',1413,4),(1443,'поселок Сосновка',1413,4),(1444,'поселок Таргиз',1413,4),(1445,'деревня Тарея',1413,4),(1446,'поселок Тарея',1413,4),(1447,'деревня Тахтамай',1413,4),(1448,'посёлок Хоняки',1413,4),(1449,'село Червянка',1413,4),(1450,'поселок Чукша',1413,4),(1451,'рабочий посёлок Чунский',2,3),(1452,'Шелеховский район',2,3),(1453,'село Баклаши',1452,4),(1454,'Подкаменское муниципальное образование',1452,4),(1455,'поселок Большая Глубокая',1454,5),(1456,'посёлок Глубокая',1454,5),(1457,'поселок Граматуха',1454,5),(1458,'поселок Источник',1454,5),(1459,'поселок Родниковый',1454,5),(1460,'посёлок Санаторный',1454,5),(1461,'посёлок Трудный',1454,5),(1462,'посёлок Хузино',1454,5),(1463,'посёлок Большой Луг',1452,4),(1464,'Баклашинское сельское поселение',1452,4),(1465,'село Введенщина',1464,5),(1466,'поселок Пионерск',1464,5),(1467,'посёлок Чистые Ключи',1464,5),(1468,'Олхинское муниципальное образование',1452,4),(1469,'посёлок Дачная',1468,5),(1470,'посёлок Летняя',1468,5),(1471,'деревня Олха',1468,5),(1472,'Шаманское муниципальное образование',1452,4),(1473,'поселок Куйтун',1472,5),(1474,'село Моты',1472,5),(1475,'Большелугское муниципальное образование',1452,4),(1476,'посёлок Огоньки',1475,5),(1477,'посёлок Орлёнок',1475,5),(1478,'посёлок Рассоха',1475,5),(1479,'посёлок Таёжный',1475,5),(1480,'посёлок Ягодный',1475,5),(1481,'поселок Подкаменная',1452,4),(1482,'село Шаманка',1452,4),(1483,'Шелехов',2,3),(1484,'Эхирит-Булагатский район',2,3),(1485,'деревня Алужино',1484,4),(1486,'село Ахины',1484,4),(1487,'деревня Байтог',1484,4),(1488,'деревня Барда',1484,4),(1489,'деревня Батхай',1484,4),(1490,'деревня Баянгазуй',1484,4),(1491,'поселок Бозой',1484,4),(1492,'деревня Большая Кура',1484,4),(1493,'село Булуса',1484,4),(1494,'деревня Бухтумур',1484,4),(1495,'деревня Верхний Кукут',1484,4),(1496,'деревня Верхняя Идыга',1484,4),(1497,'село Гаханы',1484,4),(1498,'деревня Гушит',1484,4),(1499,'деревня Еловка',1484,4),(1500,'деревня Зады',1484,4),(1501,'село Захал',1484,4),(1502,'деревня Ишины',1484,4),(1503,'село Капсал',1484,4),(1504,'деревня Комой',1484,4),(1505,'деревня Корсук',1484,4),(1506,'посёлок Красный Яр',1484,4),(1507,'деревня Кударейка',1484,4),(1508,'деревня Кукунут',1484,4),(1509,'село Кулункун (Ата)',1484,4),(1510,'деревня Куяда',1484,4),(1511,'деревня Мурино (Элита)',1484,4),(1512,'село Муромцовка',1484,4),(1513,'деревня Нижний Кукут',1484,4),(1514,'деревня Нижняя Идыга',1484,4),(1515,'село Новониколаевск',1484,4),(1516,'село Олой',1484,4),(1517,'посёлок Ордынский',1484,4),(1518,'деревня Отонхой',1484,4),(1519,'деревня Рудовщина',1484,4),(1520,'деревня Сагарук',1484,4),(1521,'поселок Свердлово',1484,4),(1522,'деревня Серафимовск',1484,4),(1523,'деревня Солянка',1484,4),(1524,'деревня Тимошинск',1484,4),(1525,'деревня Толодой',1484,4),(1526,'деревня Тотохон',1484,4),(1527,'село Тугутуй',1484,4),(1528,'посёлок Усть-Ордынский',1484,4),(1529,'деревня Хабаровская',1484,4),(1530,'село Харазаргай',1484,4),(1531,'деревня Харанут',1484,4),(1532,'село Харат',1484,4),(1533,'деревня Хуты',1484,4),(1534,'деревня Шохтой',1484,4),(1535,'Братск',2,3),(1536,'Падунский район',1535,4),(1537,'Правобережный район',1535,4),(1538,'Центральный район',1535,4),(1539,'Зима',2,3),(1540,'Саянск',2,3),(1541,'Свирск',2,3),(1542,'Тулун',2,3),(1543,'Усолье-Сибирское',2,3),(1544,'Усть-Илимск',2,3),(1545,'Черемхово',2,3),(1546,'городской округ Усолье-Сибирское',2,3),(1547,'Иркутский район',1,2),(1548,'садовые участки',1547,3),(1549,'Уриковское муниципальное образование',1547,3),(1550,'деревня Ангара',1549,4),(1551,'заимка Глазунова',1549,4),(1552,'деревня Грановщина',1549,4),(1553,'посёлок Малая Топка',1549,4),(1554,'деревня Московщина',1549,4),(1555,'поселок Парфеновка',1549,4),(1556,'деревня Столбова',1549,4),(1557,'село Урик',1549,4),(1558,'деревня Хайрюзовка',1549,4),(1559,'Листвянское муниципальное образование',1547,3),(1560,'поселок Ангарские Хутора',1559,4),(1561,'посёлок Большие Коты',1559,4),(1562,'рабочий посёлок Листвянка',1559,4),(1563,'поселок Никола',1559,4),(1564,'Гороховское муниципальное образование',1547,3),(1565,'деревня Баруй',1564,4),(1566,'поселок Бухун',1564,4),(1567,'деревня Верхний Кет',1564,4),(1568,'село Горохово',1564,4),(1569,'деревня Сайгуты',1564,4),(1570,'деревня Степановка',1564,4),(1571,'Большереченское муниципальное образование',1547,3),(1572,'посёлок Берёзка',1571,4),(1573,'рабочий посёлок Большая Речка',1571,4),(1574,'посёлок Бурдугуз',1571,4),(1575,'посёлок Бутырки',1571,4),(1576,'поселок Дорожный',1571,4),(1577,'поселок Тальцы',1571,4),(1578,'поселок Черемшанка',1571,4),(1579,'Голоустненское муниципальное образование',1547,3),(1580,'посёлок Большое Голоустное',1579,4),(1581,'село Малое Голоустное',1579,4),(1582,'поселок Нижний Кочергат',1579,4),(1583,'Ревякинское муниципальное образование',1547,3),(1584,'деревня Бургаз',1583,4),(1585,'деревня Каштак',1583,4),(1586,'деревня Черёмушка',1583,4),(1587,'Ушаковское муниципальное образование',1547,3),(1588,'деревня Бурдаковка',1587,4),(1589,'поселок Горячий Ключ',1587,4),(1590,'посёлок Добролет',1587,4),(1591,'поселок Лебединка',1587,4),(1592,'деревня Новолисиха',1587,4),(1593,'поселок Патроны',1587,4),(1594,'посёлок Первомайский',1587,4),(1595,'село Пивовариха',1587,4),(1596,'заимка Поливаниха',1587,4),(1597,'деревня Худякова',1587,4),(1598,'Оёкское муниципальное образование',1547,3),(1599,'деревня Бутырки',1598,4),(1600,'деревня Галки',1598,4),(1601,'деревня Жердовка',1598,4),(1602,'деревня Зыкова',1598,4),(1603,'деревня Коты',1598,4),(1604,'деревня Максимовщина',1598,4),(1605,'деревня Мишонкова',1598,4),(1606,'деревня Турская',1598,4),(1607,'Усть-Балейское муниципальное образование',1547,3),(1608,'деревня Быкова',1607,4),(1609,'село Еловка',1607,4),(1610,'деревня Зорино-Быково',1607,4),(1611,'поселок Усть-Балей',1607,4),(1612,'Мамонское муниципальное образование',1547,3),(1613,'заимка Вдовина',1612,4),(1614,'деревня Малая Еланка',1612,4),(1615,'Хомутовское муниципальное образование',1547,3),(1616,'поселок Горный',1615,4),(1617,'деревня Куда',1615,4),(1618,'посёлок Плишкино',1615,4),(1619,'деревня Позднякова',1615,4),(1620,'деревня Талька',1615,4),(1621,'Ширяевское муниципальное образование',1547,3),(1622,'деревня Горяшина',1621,4),(1623,'деревня Лыловщина',1621,4),(1624,'деревня Тайтура',1621,4),(1625,'деревня Тихонова Падь',1621,4),(1626,'поселок Дзержинск',1547,3),(1627,'Никольское муниципальное образование',1547,3),(1628,'деревня Егоровщина',1627,4),(1629,'деревня Кыцигировка',1627,4),(1630,'деревня Рязановщина',1627,4),(1631,'деревня Карлук',1547,3),(1632,'село Максимовщина',1547,3),(1633,'село Мамоны',1547,3),(1634,'рабочий посёлок Маркова',1547,3),(1635,'посёлок Молодёжный',1547,3),(1636,'село Никольск',1547,3),(1637,'Молодёжное муниципальное образование',1547,3),(1638,'поселок Новая Разводная',1637,4),(1639,'Марковское муниципальное образование',1547,3),(1640,'деревня Новогрудинина',1639,4),(1641,'поселок Падь Мельничная',1639,4),(1642,'село Оек',1547,3),(1643,'деревня Ревякина',1547,3),(1644,'село Смоленщина',1547,3),(1645,'деревня Сосновый Бор',1547,3),(1646,'деревня Усть-Куда',1547,3),(1647,'село Хомутово',1547,3),(1648,'деревня Ширяева',1547,3),(1649,'Республика Бурятия',1,2),(1650,'Кабанский район',1649,3),(1651,'село Выдрино',1650,4),(1652,'Иркутск',1,2),(1653,'Кировский район',1652,3),(1654,'Куйбышевский район',1652,3),(1655,'Ленинский округ',1652,3),(1656,'Октябрьский округ',1652,3),(1657,'Свердловский округ',1652,3);
/*!40000 ALTER TABLE `admin_location` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `attractions`
--

DROP TABLE IF EXISTS `attractions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `attractions` (
  `Attraction_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Object_Type_ID` int DEFAULT NULL,
  `Category_ID` int DEFAULT NULL,
  `Description` text,
  `Admin_Location_ID` int DEFAULT NULL,
  `Latitude` decimal(10,7) NOT NULL,
  `Longitude` decimal(10,7) NOT NULL,
  `Accessibility` text,
  `City_Distance` decimal(10,7) DEFAULT NULL,
  `Key_City_ID` int DEFAULT NULL,
  `History` text,
  `Legends` text,
  `Object_Value_ID` int DEFAULT NULL,
  `Object_Value_Status_ID` int DEFAULT NULL,
  `Object_Value_Description` text,
  `Modernity` text,
  `Recreation_Potential_ID` int DEFAULT NULL,
  `Recreation_Potential_Description` text,
  `Season_ID` int DEFAULT NULL,
  `Time_Recommendation` varchar(255) DEFAULT NULL,
  `Visitor_Requirements` varchar(255) DEFAULT NULL,
  `Rules` text,
  `Guides` text,
  `Price` decimal(10,2) DEFAULT NULL,
  `Relief` text,
  `Geomorphology_ID` int DEFAULT NULL,
  `Geologic` text,
  `Climate` text,
  `Hydrology` text,
  `Flora_Fauna` text,
  `Ecologic` text,
  `Creation_Date` varchar(255) DEFAULT NULL,
  `Author_ID` int DEFAULT NULL,
  `Style_Architecture` text,
  `Materials_and_Technologies` text,
  `Creation_Purpose_ID` int DEFAULT NULL,
  `Technical_Condition_ID` int DEFAULT NULL,
  `Object_Status_ID` int DEFAULT NULL,
  `Owner_ID` int DEFAULT NULL,
  `Restoration_Works` text,
  `TCI` varchar(255) DEFAULT NULL,
  `Created` datetime DEFAULT CURRENT_TIMESTAMP,
  `Last_Updated` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `Creator_User_ID` int DEFAULT NULL,
  `Last_Updated_User_ID` int DEFAULT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Attraction_ID`),
  KEY `Object_Type_ID` (`Object_Type_ID`),
  KEY `Category_ID` (`Category_ID`),
  KEY `Admin_Location_ID` (`Admin_Location_ID`),
  KEY `Key_City_ID` (`Key_City_ID`),
  KEY `Object_Value_ID` (`Object_Value_ID`),
  KEY `Object_Value_Status_ID` (`Object_Value_Status_ID`),
  KEY `Recreation_Potential_ID` (`Recreation_Potential_ID`),
  KEY `Season_ID` (`Season_ID`),
  KEY `Geomorphology_ID` (`Geomorphology_ID`),
  KEY `Author_ID` (`Author_ID`),
  KEY `Creation_Purpose_ID` (`Creation_Purpose_ID`),
  KEY `Technical_Condition_ID` (`Technical_Condition_ID`),
  KEY `Object_Status_ID` (`Object_Status_ID`),
  KEY `Owner_ID` (`Owner_ID`),
  KEY `Creator_User_ID` (`Creator_User_ID`),
  KEY `Last_Updated_User_ID` (`Last_Updated_User_ID`),
  CONSTRAINT `attractions_ibfk_1` FOREIGN KEY (`Object_Type_ID`) REFERENCES `object_types` (`Object_Type_ID`),
  CONSTRAINT `attractions_ibfk_10` FOREIGN KEY (`Author_ID`) REFERENCES `authors` (`Author_ID`),
  CONSTRAINT `attractions_ibfk_11` FOREIGN KEY (`Creation_Purpose_ID`) REFERENCES `creation_purposes` (`Creation_Purpose_ID`),
  CONSTRAINT `attractions_ibfk_12` FOREIGN KEY (`Technical_Condition_ID`) REFERENCES `technical_conditions` (`Technical_Condition_ID`),
  CONSTRAINT `attractions_ibfk_13` FOREIGN KEY (`Object_Status_ID`) REFERENCES `object_statuses` (`Object_Status_ID`),
  CONSTRAINT `attractions_ibfk_14` FOREIGN KEY (`Owner_ID`) REFERENCES `owners` (`Owner_ID`),
  CONSTRAINT `attractions_ibfk_15` FOREIGN KEY (`Creator_User_ID`) REFERENCES `users` (`User_ID`),
  CONSTRAINT `attractions_ibfk_16` FOREIGN KEY (`Last_Updated_User_ID`) REFERENCES `users` (`User_ID`),
  CONSTRAINT `attractions_ibfk_2` FOREIGN KEY (`Category_ID`) REFERENCES `categories` (`Category_ID`),
  CONSTRAINT `attractions_ibfk_3` FOREIGN KEY (`Admin_Location_ID`) REFERENCES `admin_location` (`Admin_Location_ID`),
  CONSTRAINT `attractions_ibfk_4` FOREIGN KEY (`Key_City_ID`) REFERENCES `admin_location` (`Admin_Location_ID`),
  CONSTRAINT `attractions_ibfk_5` FOREIGN KEY (`Object_Value_ID`) REFERENCES `object_values` (`Object_Value_ID`),
  CONSTRAINT `attractions_ibfk_6` FOREIGN KEY (`Object_Value_Status_ID`) REFERENCES `object_value_statuses` (`Object_Value_Status_ID`),
  CONSTRAINT `attractions_ibfk_7` FOREIGN KEY (`Recreation_Potential_ID`) REFERENCES `recreation_potentials` (`Recreation_Potential_ID`),
  CONSTRAINT `attractions_ibfk_8` FOREIGN KEY (`Season_ID`) REFERENCES `seasons` (`Season_ID`),
  CONSTRAINT `attractions_ibfk_9` FOREIGN KEY (`Geomorphology_ID`) REFERENCES `geomorphologies` (`Geomorphology_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attractions`
--

LOCK TABLES `attractions` WRITE;
/*!40000 ALTER TABLE `attractions` DISABLE KEYS */;
INSERT INTO `attractions` VALUES (1,'Краеведческий музей в Голумети',1,1,'Описание',1,53.0373460,102.3500120,'Способы',2.0000000,1652,'Справка','Легенды',1,1,'Описание','Благо',3,'Описание',1,'Пара часов','Требования','Правила','0003535',0.00,'Рельеф',1,'Гео','Климат','Гидро','Флора','Экология','2023 до н.э.',NULL,'стиль','Материалы',1,2,3,NULL,'работы','100','2026-05-06 23:54:07','2026-05-08 18:01:50',1,1,0),(2,'Дом купца Раджабова',NULL,NULL,NULL,NULL,53.0433830,102.3680150,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:54:45','2026-05-06 23:54:45',1,1,0),(3,'Поклонный крест',NULL,NULL,NULL,NULL,53.0448230,102.3881140,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:55:12','2026-05-06 23:55:12',1,1,0),(4,'Полежаевская ГЭС',NULL,NULL,NULL,NULL,52.9650600,102.3309480,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:55:38','2026-05-06 23:55:38',1,1,0),(5,'Музей-библиотека в селе Онот',NULL,NULL,NULL,NULL,52.7372970,102.0443120,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:56:02','2026-05-06 23:56:02',1,1,0),(6,'Храм во имя св. Иннокентия ',NULL,NULL,NULL,NULL,52.7353930,102.0473160,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:56:26','2026-05-06 23:56:26',1,1,0),(7,'Подвесной мост ',NULL,NULL,NULL,NULL,52.7364890,102.0546890,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:56:50','2026-05-06 23:56:50',1,1,0),(8,'Онотское месторождение',NULL,NULL,NULL,NULL,52.7351340,102.0641260,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-05-06 23:57:21','2026-05-07 00:26:33',1,1,0);
/*!40000 ALTER TABLE `attractions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `authors`
--

DROP TABLE IF EXISTS `authors`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `authors` (
  `Author_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Description` mediumtext,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Author_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `authors`
--

LOCK TABLES `authors` WRITE;
/*!40000 ALTER TABLE `authors` DISABLE KEYS */;
/*!40000 ALTER TABLE `authors` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `categories`
--

DROP TABLE IF EXISTS `categories`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `categories` (
  `Category_ID` int NOT NULL AUTO_INCREMENT,
  `Object_Type_ID` int NOT NULL,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Category_ID`),
  KEY `Object_Type_ID` (`Object_Type_ID`),
  CONSTRAINT `categories_ibfk_1` FOREIGN KEY (`Object_Type_ID`) REFERENCES `object_types` (`Object_Type_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `categories`
--

LOCK TABLES `categories` WRITE;
/*!40000 ALTER TABLE `categories` DISABLE KEYS */;
INSERT INTO `categories` VALUES (1,2,'Геологический',0),(2,2,'Водный',0),(3,2,'Ботанический',0),(4,1,'Памятник',0),(5,1,'Музей',0),(6,1,'Промышленный объект',0),(7,1,'Культовое сооружение',0),(8,1,'Дом1',1);
/*!40000 ALTER TABLE `categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `creation_purposes`
--

DROP TABLE IF EXISTS `creation_purposes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `creation_purposes` (
  `Creation_Purpose_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Creation_Purpose_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `creation_purposes`
--

LOCK TABLES `creation_purposes` WRITE;
/*!40000 ALTER TABLE `creation_purposes` DISABLE KEYS */;
INSERT INTO `creation_purposes` VALUES (1,'Оборонительная',0),(2,'Культовая',0),(3,'Промышленная',0),(4,'Мемориальная',0);
/*!40000 ALTER TABLE `creation_purposes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `difficulties`
--

DROP TABLE IF EXISTS `difficulties`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `difficulties` (
  `Difficulty_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Difficulty_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `difficulties`
--

LOCK TABLES `difficulties` WRITE;
/*!40000 ALTER TABLE `difficulties` DISABLE KEYS */;
INSERT INTO `difficulties` VALUES (1,'Для начинающих',0),(2,'Семейный',0),(3,'Для подготовленных туристов',0);
/*!40000 ALTER TABLE `difficulties` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `geomorphologies`
--

DROP TABLE IF EXISTS `geomorphologies`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `geomorphologies` (
  `Geomorphology_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Geomorphology_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `geomorphologies`
--

LOCK TABLES `geomorphologies` WRITE;
/*!40000 ALTER TABLE `geomorphologies` DISABLE KEYS */;
INSERT INTO `geomorphologies` VALUES (1,'Гора',0),(2,'Утес',0),(3,'Пещера',0),(4,'Долина реки',0);
/*!40000 ALTER TABLE `geomorphologies` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `length_time_metrics`
--

DROP TABLE IF EXISTS `length_time_metrics`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `length_time_metrics` (
  `Length_Time_Metric_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Length_Time_Metric_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `length_time_metrics`
--

LOCK TABLES `length_time_metrics` WRITE;
/*!40000 ALTER TABLE `length_time_metrics` DISABLE KEYS */;
INSERT INTO `length_time_metrics` VALUES (1,'Час',0),(2,'День',0);
/*!40000 ALTER TABLE `length_time_metrics` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `media`
--

DROP TABLE IF EXISTS `media`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `media` (
  `Media_ID` int NOT NULL AUTO_INCREMENT,
  `Attraction_ID` int DEFAULT NULL,
  `Type` enum('photo','video') NOT NULL,
  `File_Path` varchar(1024) NOT NULL,
  PRIMARY KEY (`Media_ID`),
  KEY `Attraction_ID` (`Attraction_ID`),
  CONSTRAINT `media_ibfk_1` FOREIGN KEY (`Attraction_ID`) REFERENCES `attractions` (`Attraction_ID`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `media`
--

LOCK TABLES `media` WRITE;
/*!40000 ALTER TABLE `media` DISABLE KEYS */;
INSERT INTO `media` VALUES (5,1,'photo','1_4391df1f19894dac950da8c5c19b59e7.jpg'),(6,1,'photo','1_743e6d626d56455dac911db546fee018.jpg'),(7,1,'photo','1_122dea73628a49adb6b97f48b5649cff.png'),(8,1,'photo','1_570ce71a478d446cbce717cdc9351ea8.jpg'),(9,1,'video','1_3f3ee993948c4d44a4da1e9fccef4743.mp4'),(10,1,'photo','1_759548bfda3746e8aaf62fdbe1df366b.jpg'),(11,1,'video','1_bee59367940d4b59bc6124b88a352b3e.mp4'),(12,1,'photo','1_80e8b4ffdab2448dbb45d059bdaddcfe.jpg'),(13,1,'video','1_71d32fbe88df4db1b52706f501aeda12.mp4');
/*!40000 ALTER TABLE `media` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `object_statuses`
--

DROP TABLE IF EXISTS `object_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `object_statuses` (
  `Object_Status_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Object_Status_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `object_statuses`
--

LOCK TABLES `object_statuses` WRITE;
/*!40000 ALTER TABLE `object_statuses` DISABLE KEYS */;
INSERT INTO `object_statuses` VALUES (1,'Действующий',0),(2,'Заброшенный',0),(3,'Музеефицированный',0);
/*!40000 ALTER TABLE `object_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `object_types`
--

DROP TABLE IF EXISTS `object_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `object_types` (
  `Object_Type_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Object_Type_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `object_types`
--

LOCK TABLES `object_types` WRITE;
/*!40000 ALTER TABLE `object_types` DISABLE KEYS */;
INSERT INTO `object_types` VALUES (1,'Антропогенный',0),(2,'Природный',0),(3,'Дом',1),(5,'Дом',1),(6,'Дом',1);
/*!40000 ALTER TABLE `object_types` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `object_value_statuses`
--

DROP TABLE IF EXISTS `object_value_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `object_value_statuses` (
  `Object_Value_Status_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Object_Value_Status_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `object_value_statuses`
--

LOCK TABLES `object_value_statuses` WRITE;
/*!40000 ALTER TABLE `object_value_statuses` DISABLE KEYS */;
INSERT INTO `object_value_statuses` VALUES (1,'статус ООПТ',0),(2,'статус объекта культурного наследия',0);
/*!40000 ALTER TABLE `object_value_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `object_values`
--

DROP TABLE IF EXISTS `object_values`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `object_values` (
  `Object_Value_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Object_Value_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `object_values`
--

LOCK TABLES `object_values` WRITE;
/*!40000 ALTER TABLE `object_values` DISABLE KEYS */;
INSERT INTO `object_values` VALUES (1,'Местная',0),(2,'Региональная',0),(3,'Федеральная',0);
/*!40000 ALTER TABLE `object_values` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `owners`
--

DROP TABLE IF EXISTS `owners`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `owners` (
  `Owner_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(512) NOT NULL,
  `Description` mediumtext,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Owner_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `owners`
--

LOCK TABLES `owners` WRITE;
/*!40000 ALTER TABLE `owners` DISABLE KEYS */;
/*!40000 ALTER TABLE `owners` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recreation_potentials`
--

DROP TABLE IF EXISTS `recreation_potentials`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recreation_potentials` (
  `Recreation_Potential_ID` int NOT NULL AUTO_INCREMENT,
  `Name` text NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Recreation_Potential_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recreation_potentials`
--

LOCK TABLES `recreation_potentials` WRITE;
/*!40000 ALTER TABLE `recreation_potentials` DISABLE KEYS */;
INSERT INTO `recreation_potentials` VALUES (1,'Отдых',0),(2,'Фотоохота',0),(3,'Пикник',0),(4,'Купание',0);
/*!40000 ALTER TABLE `recreation_potentials` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `roles`
--

DROP TABLE IF EXISTS `roles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `roles` (
  `Role_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Role_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `roles`
--

LOCK TABLES `roles` WRITE;
/*!40000 ALTER TABLE `roles` DISABLE KEYS */;
INSERT INTO `roles` VALUES (1,'admin',0),(2,'user',0);
/*!40000 ALTER TABLE `roles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `route_themes`
--

DROP TABLE IF EXISTS `route_themes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `route_themes` (
  `Route_Theme_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Route_Theme_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `route_themes`
--

LOCK TABLES `route_themes` WRITE;
/*!40000 ALTER TABLE `route_themes` DISABLE KEYS */;
INSERT INTO `route_themes` VALUES (1,'Историческая',0),(2,'Природоведческая',0),(3,'Паломническая',0),(4,'Индустриальная',0);
/*!40000 ALTER TABLE `route_themes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `route_types`
--

DROP TABLE IF EXISTS `route_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `route_types` (
  `Route_Type_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Route_Type_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `route_types`
--

LOCK TABLES `route_types` WRITE;
/*!40000 ALTER TABLE `route_types` DISABLE KEYS */;
INSERT INTO `route_types` VALUES (1,'Пешеходный',0),(2,'Автобусный',0),(3,'Водный',0),(4,'Комбинированный',0);
/*!40000 ALTER TABLE `route_types` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `routes`
--

DROP TABLE IF EXISTS `routes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `routes` (
  `Route_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Route_Type_ID` int DEFAULT NULL,
  `Route_Theme_ID` int DEFAULT NULL,
  `Difficulty_ID` int DEFAULT NULL,
  `Length` decimal(10,7) DEFAULT NULL,
  `Length_Time` decimal(10,2) DEFAULT NULL,
  `Length_Time_Metric_ID` int DEFAULT NULL,
  `Description` mediumtext,
  `Recommendations` text,
  `Season_ID` int DEFAULT NULL,
  `Organisators_Contacts` varchar(512) DEFAULT NULL,
  `Admin_Location_ID` int DEFAULT NULL,
  `Start_Point_Latitude` decimal(10,7) NOT NULL,
  `Start_Point_Longitude` decimal(10,7) NOT NULL,
  `End_Point_Latitude` decimal(10,7) NOT NULL,
  `End_Point_Longitude` decimal(10,7) NOT NULL,
  `route_geometry` json DEFAULT NULL,
  `Created` datetime DEFAULT CURRENT_TIMESTAMP,
  `Last_Updated` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `Creator_User_ID` int DEFAULT NULL,
  `Last_Updated_User_ID` int DEFAULT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Route_ID`),
  KEY `Route_Type_ID` (`Route_Type_ID`),
  KEY `Route_Theme_ID` (`Route_Theme_ID`),
  KEY `Difficulty_ID` (`Difficulty_ID`),
  KEY `Length_Time_Metric_ID` (`Length_Time_Metric_ID`),
  KEY `Season_ID` (`Season_ID`),
  KEY `Admin_Location_ID` (`Admin_Location_ID`),
  KEY `Creator_User_ID` (`Creator_User_ID`),
  KEY `Last_Updated_User_ID` (`Last_Updated_User_ID`),
  CONSTRAINT `routes_ibfk_1` FOREIGN KEY (`Route_Type_ID`) REFERENCES `route_types` (`Route_Type_ID`),
  CONSTRAINT `routes_ibfk_2` FOREIGN KEY (`Route_Theme_ID`) REFERENCES `route_themes` (`Route_Theme_ID`),
  CONSTRAINT `routes_ibfk_3` FOREIGN KEY (`Difficulty_ID`) REFERENCES `difficulties` (`Difficulty_ID`),
  CONSTRAINT `routes_ibfk_4` FOREIGN KEY (`Length_Time_Metric_ID`) REFERENCES `length_time_metrics` (`Length_Time_Metric_ID`),
  CONSTRAINT `routes_ibfk_5` FOREIGN KEY (`Season_ID`) REFERENCES `seasons` (`Season_ID`),
  CONSTRAINT `routes_ibfk_6` FOREIGN KEY (`Admin_Location_ID`) REFERENCES `admin_location` (`Admin_Location_ID`),
  CONSTRAINT `routes_ibfk_7` FOREIGN KEY (`Creator_User_ID`) REFERENCES `users` (`User_ID`),
  CONSTRAINT `routes_ibfk_8` FOREIGN KEY (`Last_Updated_User_ID`) REFERENCES `users` (`User_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `routes`
--

LOCK TABLES `routes` WRITE;
/*!40000 ALTER TABLE `routes` DISABLE KEYS */;
INSERT INTO `routes` VALUES (1,'Онот Голуметь',2,1,2,40.0000000,8.00,1,'Описание','Recs',2,'53.036277, 102.351009',1,53.0373460,102.3500120,52.7351340,102.0641260,'{\"type\": \"LineString\", \"coordinates\": [[102.348378, 53.036967], [102.348422, 53.036898], [102.348508, 53.036764], [102.34592, 53.040793], [102.34698, 53.040737], [102.349193, 53.041304], [102.349532, 53.041397], [102.350044, 53.041568], [102.351503, 53.041868], [102.3521, 53.042094], [102.353059, 53.042477], [102.3542, 53.042776], [102.355135, 53.042955], [102.355864, 53.042987], [102.356394, 53.042894], [102.35716, 53.042254], [102.358334, 53.041256], [102.360757, 53.039719], [102.361428, 53.040479], [102.361567, 53.040663], [102.362368, 53.041138], [102.363253, 53.041662], [102.36342, 53.041761], [102.364408, 53.0422], [102.365706, 53.042606], [102.368082, 53.043211], [102.369012, 53.043448], [102.372531, 53.044344], [102.374069, 53.044747], [102.378146, 53.045815], [102.379296, 53.046086], [102.380522, 53.046341], [102.381002, 53.046373], [102.381472, 53.046328], [102.381724, 53.046105], [102.382432, 53.045199], [102.383044, 53.044793], [102.383757, 53.044806], [102.384299, 53.044915], [102.385221, 53.044967], [102.388186, 53.044909], [102.392826, 53.044817], [102.394012, 53.044794], [102.400728, 53.04481], [102.40203, 53.044587], [102.402876, 53.044321], [102.404763, 53.043459], [102.406496, 53.042276], [102.411725, 53.037243], [102.413421, 53.034883], [102.417847, 53.03109], [102.42056, 53.027439], [102.426157, 53.01933], [102.427715, 53.01457], [102.428584, 53.01184], [102.428895, 53.010968], [102.429335, 53.010342], [102.429944, 53.009603], [102.430601, 53.008819], [102.431084, 53.008451], [102.431846, 53.008193], [102.432801, 53.00798], [102.436148, 53.007211], [102.437425, 53.006676], [102.439295, 53.0057], [102.441243, 53.004691], [102.448282, 53.000988], [102.457216, 52.996327], [102.45843, 52.996022], [102.459618, 52.995797], [102.459419, 52.995551], [102.459327, 52.995235], [102.457216, 52.996327], [102.448282, 53.000988], [102.441243, 53.004691], [102.439295, 53.0057], [102.437425, 53.006676], [102.436148, 53.007211], [102.432801, 53.00798], [102.431846, 53.008193], [102.431084, 53.008451], [102.430601, 53.008819], [102.429944, 53.009603], [102.429335, 53.010342], [102.428895, 53.010968], [102.428584, 53.01184], [102.427715, 53.01457], [102.426157, 53.01933], [102.42056, 53.027439], [102.417847, 53.03109], [102.413421, 53.034883], [102.411725, 53.037243], [102.406496, 53.042276], [102.404763, 53.043459], [102.402876, 53.044321], [102.40203, 53.044587], [102.400728, 53.04481], [102.394012, 53.044794], [102.392826, 53.044817], [102.385221, 53.044967], [102.384299, 53.044915], [102.383757, 53.044806], [102.383044, 53.044793], [102.382432, 53.045199], [102.381724, 53.046105], [102.381472, 53.046328], [102.381002, 53.046373], [102.380522, 53.046341], [102.379296, 53.046086], [102.378146, 53.045815], [102.374069, 53.044747], [102.372531, 53.044344], [102.369012, 53.043448], [102.365706, 53.042606], [102.364408, 53.0422], [102.36342, 53.041761], [102.363253, 53.041662], [102.362368, 53.041138], [102.361567, 53.040663], [102.361428, 53.040479], [102.360757, 53.039719], [102.360246, 53.039075], [102.359423, 53.038166], [102.359147, 53.037357], [102.359088, 53.036826], [102.359093, 53.036254], [102.359144, 53.036034], [102.359238, 53.035943], [102.359457, 53.035733], [102.360655, 53.034587], [102.361752, 53.033542], [102.361786, 53.033505], [102.362523, 53.032736], [102.363099, 53.031902], [102.363248, 53.031633], [102.36333, 53.030629], [102.363285, 53.030561], [102.363194, 53.030422], [102.362393, 53.029836], [102.362196, 53.029362], [102.362023, 53.02842], [102.361678, 53.027902], [102.360137, 53.026694], [102.360017, 53.026551], [102.358382, 53.024597], [102.358077, 53.024142], [102.35813, 53.023507], [102.358093, 53.023094], [102.357744, 53.022132], [102.357444, 53.021216], [102.357749, 53.01967], [102.358082, 53.019134], [102.358313, 53.018502], [102.358259, 53.017637], [102.35798, 53.016682], [102.357631, 53.015933], [102.357497, 53.01512], [102.357155, 53.014579], [102.356955, 53.014265], [102.355512, 53.013038], [102.354792, 53.011991], [102.354499, 53.011179], [102.354364, 53.010601], [102.354478, 53.009718], [102.354564, 53.007902], [102.354897, 53.006356], [102.355304, 53.004235], [102.35568, 53.001709], [102.355359, 53.000575], [102.354989, 52.99974], [102.354158, 52.997941], [102.353061, 52.995535], [102.352204, 52.994092], [102.350676, 52.992768], [102.348809, 52.99078], [102.345863, 52.985909], [102.342302, 52.980021], [102.340564, 52.977599], [102.338919, 52.976022], [102.3367, 52.974074], [102.331919, 52.972535], [102.330563, 52.972056], [102.32799, 52.970978], [102.325415, 52.970267], [102.32248, 52.970032], [102.321634, 52.969918], [102.320973, 52.969797], [102.321264, 52.969441], [102.321742, 52.96928], [102.322066, 52.969247], [102.322391, 52.969295], [102.322544, 52.969304], [102.322685, 52.969302], [102.323604, 52.969182], [102.324213, 52.969049], [102.324999, 52.968189], [102.325395, 52.967849], [102.325918, 52.967402], [102.326726, 52.966956], [102.327235, 52.966482], [102.327158, 52.966055], [102.326719, 52.965449], [102.326689, 52.965311], [102.326675, 52.965147], [102.326763, 52.965051], [102.32691, 52.964888], [102.32826, 52.964861], [102.329688, 52.964395], [102.33022, 52.963848], [102.331991, 52.963841], [102.333906, 52.962774], [102.331991, 52.963841], [102.33022, 52.963848], [102.329688, 52.964395], [102.329688, 52.964395], [102.32826, 52.964861], [102.32691, 52.964888], [102.326763, 52.965051], [102.326675, 52.965147], [102.326689, 52.965311], [102.326719, 52.965449], [102.327158, 52.966055], [102.327235, 52.966482], [102.326726, 52.966956], [102.325918, 52.967402], [102.325395, 52.967849], [102.324999, 52.968189], [102.324213, 52.969049], [102.323604, 52.969182], [102.322685, 52.969302], [102.322544, 52.969304], [102.322391, 52.969295], [102.322066, 52.969247], [102.321742, 52.96928], [102.321264, 52.969441], [102.320973, 52.969797], [102.320129, 52.969688], [102.319365, 52.969641], [102.318375, 52.969632], [102.317627, 52.969675], [102.317248, 52.969735], [102.3164, 52.969931], [102.315916, 52.970077], [102.314303, 52.970725], [102.312792, 52.971179], [102.311614, 52.971515], [102.310419, 52.971896], [102.309673, 52.972064], [102.308938, 52.972194], [102.308195, 52.972275], [102.305847, 52.972428], [102.304623, 52.972472], [102.303189, 52.972424], [102.301811, 52.97235], [102.300114, 52.972267], [102.299548, 52.972208], [102.298698, 52.97206], [102.297979, 52.9719], [102.297463, 52.97175], [102.29706, 52.971542], [102.297007, 52.971378], [102.297062, 52.971249], [102.298034, 52.970427], [102.298607, 52.969842], [102.299848, 52.968864], [102.301018, 52.968087], [102.301939, 52.967591], [102.302399, 52.967395], [102.304408, 52.966753], [102.304653, 52.966484], [102.304992, 52.965809], [102.305226, 52.965542], [102.305448, 52.965387], [102.305805, 52.965088], [102.305934, 52.964915], [102.305956, 52.964706], [102.305856, 52.964454], [102.305661, 52.964179], [102.305461, 52.963984], [102.305068, 52.963596], [102.304654, 52.963261], [102.303947, 52.962842], [102.303407, 52.962639], [102.302901, 52.96258], [102.302475, 52.962593], [102.301701, 52.962721], [102.301143, 52.962752], [102.300768, 52.962692], [102.300393, 52.962577], [102.29888, 52.961842], [102.298302, 52.961503], [102.297978, 52.961069], [102.297451, 52.95991], [102.29714, 52.957834], [102.297883, 52.956516], [102.298343, 52.955655], [102.296975, 52.953895], [102.296158, 52.952168], [102.295617, 52.951739], [102.295219, 52.951519], [102.294093, 52.951147], [102.293644, 52.950702], [102.293373, 52.950445], [102.292927, 52.95022], [102.287439, 52.949002], [102.284721, 52.947445], [102.283346, 52.946625], [102.281961, 52.946061], [102.280792, 52.9458], [102.27881, 52.945726], [102.277912, 52.945537], [102.276369, 52.943606], [102.276256, 52.942884], [102.276489, 52.941253], [102.276353, 52.940757], [102.275697, 52.939744], [102.269779, 52.936782], [102.269204, 52.93657], [102.261879, 52.933859], [102.25291, 52.932273], [102.251193, 52.93181], [102.249477, 52.931051], [102.246172, 52.928936], [102.241691, 52.925976], [102.237685, 52.923318], [102.23509, 52.921634], [102.230734, 52.918788], [102.229563, 52.918285], [102.221023, 52.915801], [102.217698, 52.913651], [102.214311, 52.911803], [102.202635, 52.904567], [102.200704, 52.903052], [102.199248, 52.901734], [102.196069, 52.897241], [102.193626, 52.891586], [102.194871, 52.888854], [102.194073, 52.886146], [102.193579, 52.882445], [102.19618, 52.880373], [102.197596, 52.877602], [102.198111, 52.875271], [102.197399, 52.872886], [102.196888, 52.871839], [102.197059, 52.868873], [102.1956, 52.865505], [102.195253, 52.860608], [102.193991, 52.857524], [102.195729, 52.85216], [102.195257, 52.849335], [102.19633, 52.84734], [102.195171, 52.840886], [102.195897, 52.838966], [102.196004, 52.837993], [102.196351, 52.836647], [102.195815, 52.834858], [102.195532, 52.834066], [102.196094, 52.831617], [102.195854, 52.831071], [102.194999, 52.830127], [102.193837, 52.828763], [102.193347, 52.827352], [102.193733, 52.824811], [102.193386, 52.822905], [102.191534, 52.821284], [102.189792, 52.81747], [102.189513, 52.816509], [102.190651, 52.811258], [102.191845, 52.805384], [102.191466, 52.80042], [102.190897, 52.795102], [102.187593, 52.790819], [102.185941, 52.788249], [102.181305, 52.780997], [102.170207, 52.773703], [102.169976, 52.773451], [102.169848, 52.773259], [102.168542, 52.769788], [102.168142, 52.769487], [102.155807, 52.762108], [102.142478, 52.758711], [102.128942, 52.755239], [102.126867, 52.755115], [102.119114, 52.753706], [102.118532, 52.753633], [102.11449, 52.753648], [102.109351, 52.754226], [102.091335, 52.752692], [102.089993, 52.752503], [102.087032, 52.752042], [102.085969, 52.751791], [102.085485, 52.751611], [102.08512, 52.751389], [102.084517, 52.750918], [102.081538, 52.748444], [102.081437, 52.74837], [102.080294, 52.747535], [102.078931, 52.746538], [102.078261, 52.746233], [102.077242, 52.745898], [102.071387, 52.744415], [102.068766, 52.743667], [102.065565, 52.742567], [102.062516, 52.742605], [102.061329, 52.74262], [102.060401, 52.74263], [102.058569, 52.742649], [102.055833, 52.742678], [102.050478, 52.742735], [102.049627, 52.742744], [102.049503, 52.742606], [102.049294, 52.742411], [102.049063, 52.74221], [102.049111, 52.742139], [102.049251, 52.741638], [102.049396, 52.740973], [102.049412, 52.740826], [102.049374, 52.740719], [102.048859, 52.740109], [102.048287, 52.739589], [102.047739, 52.739836], [102.047108, 52.739297], [102.04641, 52.738592], [102.045713, 52.738007], [102.045166, 52.737488], [102.044935, 52.737449], [102.044715, 52.737462], [102.044452, 52.737504], [102.044452, 52.737504], [102.044238, 52.737572], [102.044104, 52.737647], [102.043996, 52.737705], [102.043873, 52.736799], [102.043878, 52.736607], [102.043913, 52.736536], [102.044031, 52.736494], [102.044224, 52.736474], [102.044621, 52.736448], [102.04504, 52.736439], [102.045861, 52.736354], [102.046102, 52.736361], [102.046247, 52.736393], [102.046408, 52.736481], [102.046998, 52.736253], [102.047663, 52.735994], [102.047218, 52.735823], [102.047116, 52.735756], [102.04707, 52.735703], [102.04703, 52.73562], [102.046966, 52.735354], [102.046909, 52.73516], [102.047221, 52.735118], [102.047843, 52.735034], [102.048437, 52.735117], [102.04892, 52.735217], [102.049461, 52.735331], [102.049547, 52.735342], [102.049692, 52.735337], [102.050116, 52.735206], [102.050486, 52.735086], [102.050682, 52.73506], [102.050953, 52.735061], [102.051441, 52.735121], [102.051967, 52.735248], [102.052251, 52.735375], [102.0526, 52.735596], [102.053954, 52.736877], [102.054359, 52.73726], [102.056068, 52.736633], [102.057994, 52.735848], [102.058096, 52.735838], [102.058193, 52.735859], [102.058301, 52.735904], [102.058424, 52.73606], [102.058475, 52.736154], [102.058526, 52.736248]]}','2026-05-06 23:59:22','2026-05-08 18:05:05',1,1,0);
/*!40000 ALTER TABLE `routes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `routes_attractions`
--

DROP TABLE IF EXISTS `routes_attractions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `routes_attractions` (
  `Route_ID` int NOT NULL,
  `Attraction_ID` int NOT NULL,
  `Number` int NOT NULL DEFAULT '1',
  PRIMARY KEY (`Route_ID`,`Attraction_ID`),
  KEY `Attraction_ID` (`Attraction_ID`),
  CONSTRAINT `routes_attractions_ibfk_1` FOREIGN KEY (`Route_ID`) REFERENCES `routes` (`Route_ID`) ON DELETE CASCADE,
  CONSTRAINT `routes_attractions_ibfk_2` FOREIGN KEY (`Attraction_ID`) REFERENCES `attractions` (`Attraction_ID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `routes_attractions`
--

LOCK TABLES `routes_attractions` WRITE;
/*!40000 ALTER TABLE `routes_attractions` DISABLE KEYS */;
INSERT INTO `routes_attractions` VALUES (1,1,1),(1,2,2),(1,3,3),(1,4,4),(1,5,5),(1,6,6),(1,7,7),(1,8,8);
/*!40000 ALTER TABLE `routes_attractions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `seasons`
--

DROP TABLE IF EXISTS `seasons`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `seasons` (
  `Season_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Season_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `seasons`
--

LOCK TABLES `seasons` WRITE;
/*!40000 ALTER TABLE `seasons` DISABLE KEYS */;
INSERT INTO `seasons` VALUES (1,'Зима',0),(2,'Лето',0),(3,'Весна',0),(4,'Осень',0);
/*!40000 ALTER TABLE `seasons` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `technical_conditions`
--

DROP TABLE IF EXISTS `technical_conditions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `technical_conditions` (
  `Technical_Condition_ID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) NOT NULL,
  `Deleted` tinyint DEFAULT '0',
  PRIMARY KEY (`Technical_Condition_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `technical_conditions`
--

LOCK TABLES `technical_conditions` WRITE;
/*!40000 ALTER TABLE `technical_conditions` DISABLE KEYS */;
INSERT INTO `technical_conditions` VALUES (1,'Отличное',0),(2,'Удовлетворительное',0),(3,'Руинированное',0);
/*!40000 ALTER TABLE `technical_conditions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `User_ID` int NOT NULL AUTO_INCREMENT,
  `Login` varchar(255) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `Role_ID` int NOT NULL,
  PRIMARY KEY (`User_ID`),
  UNIQUE KEY `Login` (`Login`),
  KEY `Role_ID` (`Role_ID`),
  CONSTRAINT `users_ibfk_1` FOREIGN KEY (`Role_ID`) REFERENCES `roles` (`Role_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','$2b$12$Ro3dG56DUnRTSr3f/h/puevYMsDB4oSflvn0TvlIsRVcGja0nhLq2',1),(2,'yuji','$2b$12$1K1rT4uhUk65fGBWFcHnb.ZyWWN6QYRPZtjQaRLVT205vdiLyjMci',2);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-09  7:48:15
